&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Если есть библиотека БСП и есть справочник Идентификаторы объектов метаданных, то будем выбирать из него
	// Если нет - то сформируем дерево метаданных самостоятельно
	ТипСправочникаБСП = tsc_ОбщегоНазначения.ТипЗначенияОпределяемогоТипа(Метаданные.ОпределяемыеТипы.tsc_СправочникИдентификаторыОбъектовМетаданных);
	Если ТипСправочникаБСП = Неопределено Тогда
		Элементы.ГруппаСБСП.Видимость = Ложь;
		Элементы.ГруппаМетаданные.ТекущаяСтраница = Элементы.ГруппаБезБСП;
	Иначе
		Элементы.ГруппаБезБСП.Видимость = Ложь;
		Элементы.ГруппаМетаданные.ТекущаяСтраница = Элементы.ГруппаСБСП;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКДаннымНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОграниченияРазвертки = tsc_РаботаСФормуламиКлиентСервер.ОграниченияРазверткиОперандов();
	ОграниченияРазвертки.НеВыводимыеРеквизиты = "ВерсияДанных";
	ОграниченияРазвертки.ВыводитьТабличныеЧасти = Истина;
	ОграниченияРазвертки.РеквизитыИТабличныеЧастиВГруппах = Ложь;
	ОграниченияРазвертки.НеВыводимыеТабличныеЧасти = "КонтактнаяИнформация,ДополнительныеРеквизиты";
	ОграниченияРазвертки.НеВыводитьРеквизитыИТабличныеЧастиНачинающиесяСУдалить = Ложь;
	ОграниченияРазвертки.ВыводитьТЧТолькоНа1омУровне = Ложь;
	ОграниченияРазвертки.РазворачиватьСтрокиАлгоритмов = Истина;
	
	Если ЗначениеЗаполнено(ТипДанных) Тогда
		ОтборПоТипуДанных = Новый ОписаниеТипов(ТипДанных);
	Иначе
		ОтборПоТипуДанных = Новый ОписаниеТипов("Неопределено");
	КонецЕсли;
	ПараметрыРедактированияВыражения = Новый Структура;
	ПараметрыРедактированияВыражения.Вставить("ТипЗначения", 				ОтборПоТипуДанных);
	ПараметрыРедактированияВыражения.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанныхЛюбыеМетаданные(ЭтаФорма.УникальныйИдентификатор, МетаданныеСтрока));
	ПараметрыРедактированияВыражения.Вставить("ОграниченияРазвертки", 		ОграниченияРазвертки);	
	ПараметрыРедактированияВыражения.Вставить("ТекущееВыражение",           ПутьКДанным);
	ПараметрыРедактированияВыражения.Вставить("ОтборПоТипуЗначения", 		ОтборПоТипу);
	
	ДополнительныеПараметры = Новый Структура("Форма, Элемент", ЭтаФорма, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПоляЗаполненияАналитикиПослеЗакрытия", ЭтотОбъект,
		ДополнительныеПараметры);
		
		
	ОткрытьФорму(
		"ОбщаяФорма.tsc_ВыборПоляПутиКДанным",
		ПараметрыРедактированияВыражения,
		ЭтаФорма,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоляЗаполненияАналитикиПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если Результат <> Неопределено Тогда
		Результат = СокрЛП(Результат);
		Если Форма[Элемент.Имя] <> Результат Тогда
			Форма.Модифицированность = Истина;
			Форма[Элемент.Имя] = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторФормулПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если Результат <> Неопределено Тогда
		Результат = СокрЛП(Результат);
		Если Форма[Элемент.Имя] <> Результат Тогда
			Форма.Модифицированность = Истина;
			Форма[Элемент.Имя] = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресаВХДеревьев(ОграниченияРазвертки, УникальныйИдентификаторФормы, МетаданныеСтрокой)
	Рез = Новый Структура("АдресВХОперандов, АдресВХОператоров", "", "");
	Рез.АдресВХОперандов = ДеревоОперандовЛюбыеМетаданные(ОграниченияРазвертки, УникальныйИдентификаторФормы, МетаданныеСтрокой);
	Рез.АдресВХОператоров = АдресДереваОператоров(УникальныйИдентификаторФормы);
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция ДеревоОперандовЛюбыеМетаданные(ОграниченияРазвертки, УникальныйИдентификаторФормы, МетаданныеСтрокой)
 	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(МетаданныеСтрокой);
	Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда 
		ТекстСообщения = НСТр("ru = 'Выберите объект метаданных'");
		Сообщить(ТекстСообщения);
		
		
		Для каждого МДДок Из Метаданные.Документы Цикл
			ОбъектМетаданных = МДДок; 
		КонецЦикла;
		Если ОбъектМетаданных = Неопределено Тогда
			Для каждого МДСпр Из Метаданные.Справочники Цикл
				ОбъектМетаданных = МДСпр;
			КонецЦикла;
		КонецЕсли; 

	КонецЕсли;
	ТипЗначения = tsc_РаботаСФормулами.ОписаниеТиповПоОбъектуМетаданных(ОбъектМетаданных);
	
	ДеревоОперандов = tsc_РаботаСФормулами.ПолучитьПустоеДеревоОперандов();
	
	КорневаяСтрокаДерева = tsc_РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = ОбъектМетаданных.Имя;
	КорневаяСтрокаДерева.Представление = ОбъектМетаданных.Представление();
	КорневаяСтрокаДерева.ТипЗначения = ТипЗначения;
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Истина;
	
	tsc_РаботаСФормулами.РазвернутьСтрокуОперанда(КорневаяСтрокаДерева, ОграниченияРазвертки);
	
	АдресХранения = ПоместитьВоВременноеХранилище(ДеревоОперандов, УникальныйИдентификаторФормы);
	Возврат АдресХранения;
КонецФункции

&НаСервереБезКонтекста
Функция АдресСхемыКомпоновкиДанныхЛюбыеМетаданные(УникальныйИдентификаторФормы, МетаданныеСтрокой)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(МетаданныеСтрокой);
	Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда
		ТекстСообщения = НСТр("ru = 'Выберите объект метаданных'");
		Сообщить(ТекстСообщения);
		
		
		Для каждого МДДок Из Метаданные.Документы Цикл
			ОбъектМетаданных = МДДок; 
		КонецЦикла;
		Если ОбъектМетаданных = Неопределено Тогда
			Для каждого МДСпр Из Метаданные.Справочники Цикл
				ОбъектМетаданных = МДСпр;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	ТипЗначения = tsc_РаботаСФормулами.ОписаниеТиповПоОбъектуМетаданных(ОбъектМетаданных);
	
	Схема = tsc_РаботаСФормулами.СхемаКомпоновкиПолученияРеквизитовПоТипуЗначения(ТипЗначения);
	
	АдресХранения = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификаторФормы);
	Возврат АдресХранения;
КонецФункции

&НаСервереБезКонтекста
Функция АдресДереваОператоров(УникальныйИдентификаторФормы)
	
	ПараметрыОператоров = tsc_РаботаСФормулами.ПараметрыПостроенияДереваОператоров();
	
	АдресХранилищаДереваОператоров = tsc_РаботаСФормулами.ПостроитьДеревоОператоров(ПараметрыОператоров, УникальныйИдентификаторФормы);
	Возврат АдресХранилищаДереваОператоров;	
КонецФункции

&НаКлиенте
Процедура ФормулаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОграниченияРазвертки = tsc_РаботаСФормуламиКлиентСервер.ОграниченияРазверткиОперандов();
	ОграниченияРазвертки.НеВыводимыеРеквизиты = "ВерсияДанных";
	ОграниченияРазвертки.ВыводитьТабличныеЧасти = Истина;
	ОграниченияРазвертки.РеквизитыИТабличныеЧастиВГруппах = Ложь;
	ОграниченияРазвертки.НеВыводимыеТабличныеЧасти = "КонтактнаяИнформация,ДополнительныеРеквизиты";
	ОграниченияРазвертки.НеВыводитьРеквизитыИТабличныеЧастиНачинающиесяСУдалить = Ложь;
	ОграниченияРазвертки.ВыводитьТЧТолькоНа1омУровне = Ложь;
	ОграниченияРазвертки.РазворачиватьСтрокиАлгоритмов = Истина;
	
	АдресаВХДеревьев = ПолучитьАдресаВХДеревьев(ОграниченияРазвертки, ЭтаФорма.УникальныйИдентификатор, МетаданныеСтрока);
	
	ОтборПоТипуДанных = Новый ОписаниеТипов("Строка");
	ПараметрыРедактированияВыражения = Новый Структура;
	ПараметрыРедактированияВыражения.Вставить("Формула", ЭтаФорма[Элемент.Имя]);
	ПараметрыРедактированияВыражения.Вставить("ТипРезультата", ОтборПоТипуДанных);
	ПараметрыРедактированияВыражения.Вставить("ДеревоОперандов", АдресаВХДеревьев.АдресВХОперандов);
	ПараметрыРедактированияВыражения.Вставить("Операторы", АдресаВХДеревьев.АдресВХОператоров);
	ПараметрыРедактированияВыражения.Вставить("ОграниченияРазверткиОперандов", ОграниченияРазвертки);	
	
	ДополнительныеПараметры = Новый Структура("Форма, Элемент", ЭтаФорма, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("КонструкторФормулПослеЗакрытия", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ОткрытьФорму(
		"ОбщаяФорма.tsc_КонструкторФормул",
		ПараметрыРедактированияВыражения,
		ЭтаФорма,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеСтрокаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("МетаданныеСтрокаПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("Обработка.tsc_ПримерОткрытияКонструктораФормул.Форма.ФормаВыбораОбъектаМетаданных",, Элемент, 
			УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура МетаданныеСтрокаПослеВыбора(Значение, ДопПараметры) Экспорт
	Если НЕ Значение = Неопределено Тогда
		МетаданныеСтрока = Значение;
	КонецЕсли;
КонецПроцедуры

&НасервереБезКонтекста
Функция ПолучитьМетаданныеСтрокой(МетаданныеИсточник)
	Если ЗначениеЗаполнено(МетаданныеИсточник) Тогда
		МДСпрИдентификаторыОбъектовМетаданных = tsc_ОбщегоНазначения.ОбъектМДОпределяемогоТипа(Метаданные.ОпределяемыеТипы.tsc_СправочникИдентификаторыОбъектовМетаданных);
		МенеджерСправочника = Справочники[МДСпрИдентификаторыОбъектовМетаданных.Имя];
		ОбъектМетаданных = МенеджерСправочника.ОбъектМетаданныхПоИдентификатору(МетаданныеИсточник, Истина);
		Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда
			МетаданныеСтрока = "";
		Иначе
			МетаданныеСтрока = ОбъектМетаданных.ПолноеИмя();
		КонецЕсли;
	Иначе
		МетаданныеСтрока = "";	
	КонецЕсли;
	Возврат МетаданныеСтрока;
КонецФункции

&НаКлиенте
Процедура МетаданныеИсточникПриИзменении(Элемент)
	МетаданныеСтрока = ПолучитьМетаданныеСтрокой(МетаданныеИсточник);	
КонецПроцедуры



