#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДополнитьТаблицуПоддерживаемыхСвойств(ТаблицаСвойств) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения") Тогда
		Свойства = ТаблицаСвойств.Добавить();
		Свойства.МетаданныеИсточника = Метаданные.ПланыВидовХарактеристик.ДолжностиПодключаемыеХарактеристики;
		Свойства.ПрефиксТипаВидаХарактеристик = "Длж.";
		Свойства.ПолеИдентификатора = "Наименование";
		Свойства.ПолеТипаЗначений = "ТипЗначения";
		Свойства.ИспользуетсяВыражениеТипаЗначений = Ложь;
		Свойства.ВыражениеТипаЗначений = "";
		Свойства.УникальностьИмениВПределахВсейТаблицыХарактеристик = Истина;
		
		Свойства = ТаблицаСвойств.Добавить();
		Свойства.МетаданныеИсточника = Метаданные.ПланыВидовХарактеристик.НачисленияПодключаемыеХарактеристики;
		Свойства.ПрефиксТипаВидаХарактеристик = "Нач.";
		Свойства.ПолеИдентификатора = "Наименование";
		Свойства.ПолеТипаЗначений = "ТипЗначения";
		Свойства.ИспользуетсяВыражениеТипаЗначений = Ложь;
		Свойства.ВыражениеТипаЗначений = "";
		Свойства.УникальностьИмениВПределахВсейТаблицыХарактеристик = Истина;
		
		Свойства = ТаблицаСвойств.Добавить();
		Свойства.МетаданныеИсточника = Метаданные.ПланыВидовХарактеристик.ШтатноеРасписаниеПодключаемыеХарактеристики;
		Свойства.ПрефиксТипаВидаХарактеристик = "ШтР.";
		Свойства.ПолеИдентификатора = "Наименование";
		Свойства.ПолеТипаЗначений = "ТипЗначения";
		Свойства.ИспользуетсяВыражениеТипаЗначений = Ложь;
		Свойства.ВыражениеТипаЗначений = "";
		Свойства.УникальностьИмениВПределахВсейТаблицыХарактеристик = Истина;
	КонецЕсли;
	
КонецПроцедуры  

Процедура ДополнитьТаблицуПоддерживаемыхСвойствАлгоритмов(ТаблицаСвойств) Экспорт
	
	#Область АлгоритмРуководителиОбъектов
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		
		МодульТЦР_Руководители = ОбщегоНазначения.ОбщийМодуль("ТЦР_Руководители");
		МассивТиповОбъектовРуководителейИПодписантов = Новый Массив;
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникПодразделенияОрганизаций"].Тип.Типы()[0]);
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникШтатноеРасписание"].Тип.Типы()[0]);
		//МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникСотрудники"].Тип.Типы()[0]);
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникОрганизации"].Тип.Типы()[0]);
		
		МассивТиповРуководителей = МодульТЦР_Руководители.РуководителиОбъекта(Неопределено, ТекущаяДатаСеанса());
		
		СтрокаСвойств = ТаблицаСвойств.Добавить();
		СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Рук.";
		СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
		СтрокаСвойств.Идентификатор = "Руководители";
		СтрокаСвойств.Представление = НСТр("ru = 'Руководители'");
		СтрокаСвойств.ЭтоГруппа = Истина;
		СтрокаСвойств.Родитель = "";
		
		Для каждого Строка Из МассивТиповРуководителей Цикл
				
			СтрокаСвойств = ТаблицаСвойств.Добавить();
			СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Рук.";
			СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
			СтрокаСвойств.Идентификатор = Строка.ИдентификаторДляФормул;
			СтрокаСвойств.Представление = Строка.Представление;
			СтрокаСвойств.ЭтоГруппа = Истина;
			СтрокаСвойств.Родитель = "Руководители";
			
			Для каждого Колонка Из МассивТиповРуководителей.Колонки Цикл
				Если Колонка.Имя = "Предствление"
					ИЛИ Колонка.Имя = "ИдентификаторДляФормул" Тогда
					Продолжить;
				КонецЕсли;
					
				СтрокаСвойств = ТаблицаСвойств.Добавить();
				СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Рук.";
				СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
				СтрокаСвойств.Идентификатор = СтрШаблон("%1|%2", Строка.ИдентификаторДляФормул, Колонка.Имя);
				
				ТипКолонки = Колонка.ТипЗначения;
				Типы = ТипКолонки.Типы();
				ТипNull = Типы.Найти(Тип("Null"));
				Если НЕ ТипNull = Неопределено Тогда
					Типы.Удалить(ТипNull);
				КонецЕсли;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Новый ОписаниеТипов(Типы,ТипКолонки.КвалификаторыЧисла,ТипКолонки.КвалификаторыСтроки,ТипКолонки.КвалификаторыДаты);
				
				СтрокаСвойств.Представление = Колонка.Имя;
				СтрокаСвойств.ЭтоГруппа = Ложь;
				СтрокаСвойств.Родитель = Строка.ИдентификаторДляФормул;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Колонка.ТипЗначения;
				СтрокаСвойств.ФункцияДляВычисления = "tsc_РаботаСФормуламиПереопределяемый.ПолучитьРуководителя";
				СтрокаСвойств.ФункцияУказанияДопКолонокПриРазвертке = "tsc_РаботаСФормуламиПереопределяемый.ПриВыводеАлгоритмаВДеревеОперандов"; 
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АлгоритмПодписантовОбъектов
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		
		МодульТЦР_Подписанты = ОбщегоНазначения.ОбщийМодуль("ТЦР_Подписанты");
		МассивТиповОбъектовРуководителейИПодписантов = Новый Массив;
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникПодразделенияОрганизаций"].Тип.Типы()[0]);
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникШтатноеРасписание"].Тип.Типы()[0]);
		//МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникСотрудники"].Тип.Типы()[0]);
		МассивТиповОбъектовРуководителейИПодписантов.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникОрганизации"].Тип.Типы()[0]);
		
		МассивТиповПодписантов	 = МодульТЦР_Подписанты.ПодписантыОбъекта(Неопределено, ТекущаяДатаСеанса());
		
		СтрокаСвойств = ТаблицаСвойств.Добавить();
		СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Подп.";
		СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
		СтрокаСвойств.Идентификатор = "Подписанты";
		СтрокаСвойств.Представление = НСТр("ru = 'Подписанты'");
		СтрокаСвойств.ЭтоГруппа = Истина;
		СтрокаСвойств.Родитель = "";
		
		Для каждого Строка Из МассивТиповПодписантов Цикл
				
			СтрокаСвойств = ТаблицаСвойств.Добавить();
			СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Подп.";
			СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
			СтрокаСвойств.Идентификатор = Строка.ИдентификаторДляФормул;
			СтрокаСвойств.Представление = Строка.Представление;
			СтрокаСвойств.ЭтоГруппа = Истина;
			СтрокаСвойств.Родитель = "Подписанты";
			
			Для каждого Колонка Из МассивТиповПодписантов.Колонки Цикл
				Если Колонка.Имя = "Предствление"
					ИЛИ Колонка.Имя = "ИдентификаторДляФормул" Тогда
					Продолжить;
				КонецЕсли;
					
				СтрокаСвойств = ТаблицаСвойств.Добавить();
				СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "Подп.";
				СтрокаСвойств.МассивТиповИсточников = МассивТиповОбъектовРуководителейИПодписантов;
				СтрокаСвойств.Идентификатор = СтрШаблон("%1|%2", Строка.ИдентификаторДляФормул, Колонка.Имя);
				
				ТипКолонки = Колонка.ТипЗначения;
				Типы = ТипКолонки.Типы();
				ТипNull = Типы.Найти(Тип("Null"));
				Если НЕ ТипNull = Неопределено Тогда
					Типы.Удалить(ТипNull);
				КонецЕсли;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Новый ОписаниеТипов(Типы,ТипКолонки.КвалификаторыЧисла,ТипКолонки.КвалификаторыСтроки,ТипКолонки.КвалификаторыДаты);
				
				СтрокаСвойств.Представление = Колонка.Имя;
				СтрокаСвойств.ЭтоГруппа = Ложь;
				СтрокаСвойств.Родитель = Строка.ИдентификаторДляФормул;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Колонка.ТипЗначения;
				СтрокаСвойств.ФункцияДляВычисления = "tsc_РаботаСФормуламиПереопределяемый.ПолучитьПодписанта";
				СтрокаСвойств.ФункцияУказанияДопКолонокПриРазвертке = "tsc_РаботаСФормуламиПереопределяемый.ПриВыводеАлгоритмаВДеревеОперандов";
			КонецЦикла;
		
		КонецЦикла;
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АлгоритмОтветственныхЛиц
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
	
		МодульТЦР_Подписанты = ОбщегоНазначения.ОбщийМодуль("ТЦР_Подписанты");
		МассивТиповОтветственныхЛиц = Новый Массив;
		МассивТиповОтветственныхЛиц.Добавить(Метаданные.ОпределяемыеТипы["ТЦР_СправочникОрганизации"].Тип.Типы()[0]);
		
		МассивОтветстенныхЛиц = МодульТЦР_Подписанты.ОтветственныеЛицаОбъекта(Неопределено, ТекущаяДатаСеанса());
		
		СтрокаСвойств = ТаблицаСвойств.Добавить();
		СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "ОтвЛ.";
		СтрокаСвойств.МассивТиповИсточников = МассивТиповОтветственныхЛиц;
		СтрокаСвойств.Идентификатор = "ОтветственныеЛица";
		СтрокаСвойств.Представление = НСТр("ru = 'Ответственные лица'");
		СтрокаСвойств.ЭтоГруппа = Истина;
		СтрокаСвойств.Родитель = "";
		
		Для каждого Строка Из МассивОтветстенныхЛиц Цикл
				
			СтрокаСвойств = ТаблицаСвойств.Добавить();
			СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "ОтвЛ.";
			СтрокаСвойств.МассивТиповИсточников = МассивТиповОтветственныхЛиц;
			СтрокаСвойств.Идентификатор = Строка.Код;
			СтрокаСвойств.Представление = Строка.НаименованиеТипа;
			СтрокаСвойств.ЭтоГруппа = Истина;
			СтрокаСвойств.Родитель = "ОтветственныеЛица";
			
			Для каждого Колонка Из МассивОтветстенныхЛиц.Колонки Цикл
				СтрокаСвойств = ТаблицаСвойств.Добавить();
				СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "ОтвЛ.";
				СтрокаСвойств.МассивТиповИсточников = МассивТиповОтветственныхЛиц;
				СтрокаСвойств.Идентификатор = СтрШаблон("%1|%2", Строка.Код, Колонка.Имя);
				
				ТипКолонки = Колонка.ТипЗначения;
				Типы = ТипКолонки.Типы();
				ТипNull = Типы.Найти(Тип("Null"));
				Если НЕ ТипNull = Неопределено Тогда
					Типы.Удалить(ТипNull);
				КонецЕсли;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Новый ОписаниеТипов(Типы,ТипКолонки.КвалификаторыЧисла,ТипКолонки.КвалификаторыСтроки,ТипКолонки.КвалификаторыДаты);
				
				СтрокаСвойств.Представление = Колонка.Имя;
				СтрокаСвойств.ЭтоГруппа = Ложь;
				СтрокаСвойств.Родитель = Строка.Код;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Колонка.ТипЗначения;
				СтрокаСвойств.ФункцияДляВычисления = "tsc_РаботаСФормуламиПереопределяемый.ПолучитьОтветственноеЛицо";
				СтрокаСвойств.ФункцияУказанияДопКолонокПриРазвертке = "tsc_РаботаСФормуламиПереопределяемый.ПриВыводеАлгоритмаВДеревеОперандов";
			КонецЦикла;
		
		КонецЦикла;
	
	КонецЕсли;

	#КонецОбласти
	
	

	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения")
		И ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		
		МодульТЦР_Печать = ОбщегоНазначения.ОбщийМодуль("ТЦР_Печать");
		МассивКДС = МодульТЦР_Печать.ПолучитьИменаКДСотрудников();
		МассивТипов = Метаданные.ОпределяемыеТипы["ТЦР_СправочникСотрудники"].Тип.Типы();
		
		СтрокаСвойств = ТаблицаСвойств.Добавить();
		СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДС.";
		СтрокаСвойств.МассивТиповИсточников = МассивТипов;
		СтрокаСвойств.Идентификатор = "КадровыеДанныеСотрудников";
		СтрокаСвойств.Представление = НСТр("ru = 'Кадровые данные (сотр.)'");
		СтрокаСвойств.ЭтоГруппа = Истина;
		СтрокаСвойств.Родитель = "";
		
		Для каждого СтруктураСвойств Из МассивКДС Цикл
			СтрокаСвойств = ТаблицаСвойств.Добавить();
			СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДС.";
			СтрокаСвойств.МассивТиповИсточников = МассивТипов;
			ИД = tsc_РаботаСФормуламиКлиентСервер.ИдентификаторДляФормул(СтруктураСвойств.ИмяПапки);
			СтрокаСвойств.Идентификатор = ИД;
			СтрокаСвойств.Представление = СтруктураСвойств.ИмяПапки;
			СтрокаСвойств.ЭтоГруппа = Истина;
			СтрокаСвойств.Родитель = "КадровыеДанныеСотрудников";
			
			Для каждого Имя Из СтруктураСвойств.МассивИмен Цикл
			
				СтрокаСвойств = ТаблицаСвойств.Добавить();
				СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДС.";
				СтрокаСвойств.МассивТиповИсточников = МассивТипов;
				ИД = tsc_РаботаСФормуламиКлиентСервер.ИдентификаторДляФормул(СтруктураСвойств.ИмяПапки);
				СтрокаСвойств.Идентификатор = СтрШаблон("%1|%2", ИД, Имя);
				СтрокаСвойств.Представление = Имя;
				СтрокаСвойств.ЭтоГруппа = Ложь;
				СтрокаСвойств.Родитель = ИД;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Неопределено; // Без дальнейшей развертки
				СтрокаСвойств.ФункцияДляВычисления = "tsc_РаботаСФормуламиПереопределяемый.ПолучитьКадровыеДанныеСотрудника";	
				СтрокаСвойств.ФункцияУказанияДопКолонокПриРазвертке = "tsc_РаботаСФормуламиПереопределяемый.ПриВыводеАлгоритмаВДеревеОперандов";
			КонецЦикла;
		КонецЦикла;
		
		МассивКДФ = МодульТЦР_Печать.ПолучитьИменаКДФизЛиц(); 
		МассивТипов = Метаданные.ОпределяемыеТипы["ТЦР_СправочникФизическиеЛица"].Тип.Типы();
		
		СтрокаСвойств = ТаблицаСвойств.Добавить();
		СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДФ.";
		СтрокаСвойств.МассивТиповИсточников = МассивТипов;
		СтрокаСвойств.Идентификатор = "КадровыеДанныеФизлиц";
		СтрокаСвойств.Представление = НСТр("ru = 'Кадровые данные (физ.лиц)'");
		СтрокаСвойств.ЭтоГруппа = Истина;
		СтрокаСвойств.Родитель = "";
		
		Для каждого СтруктураСвойств Из МассивКДФ Цикл
			СтрокаСвойств = ТаблицаСвойств.Добавить();
			СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДФ.";
			СтрокаСвойств.МассивТиповИсточников = МассивТипов;
			СтрокаСвойств.Идентификатор = СтруктураСвойств.ИмяПапки;
			СтрокаСвойств.Представление = СтруктураСвойств.ИмяПапки;
			СтрокаСвойств.ЭтоГруппа = Истина;
			СтрокаСвойств.Родитель = "КадровыеДанныеФизлиц";
			
			Для каждого Имя Из СтруктураСвойств.МассивИмен Цикл
			
				СтрокаСвойств = ТаблицаСвойств.Добавить();
				СтрокаСвойств.ПрефиксТипаВидаАлгоритма = "КДФ.";
				СтрокаСвойств.МассивТиповИсточников = МассивТипов;
				СтрокаСвойств.Идентификатор = СтрШаблон("%1|%2", СтруктураСвойств.ИмяПапки, Имя);
				СтрокаСвойств.Представление = Имя;
				СтрокаСвойств.ЭтоГруппа = Ложь;
				СтрокаСвойств.Родитель = СтруктураСвойств.ИмяПапки;
				СтрокаСвойств.ОписаниеТиповРезультатаВычисления = Неопределено; // Без дальнейшей развертки
				СтрокаСвойств.ФункцияДляВычисления = "tsc_РаботаСФормуламиПереопределяемый.ПолучитьКадровыеДанныеФизлица";	
				СтрокаСвойств.ФункцияУказанияДопКолонокПриРазвертке = "tsc_РаботаСФормуламиПереопределяемый.ПриВыводеАлгоритмаВДеревеОперандов";
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыводеАлгоритмаВДеревеОперандов(СтрокаДереваАлгоритмов, СтрокаДереваОперандовРодитель, СтруктураДопПараметров) Экспорт
	// См. ФункцияУказанияДопКолонокПриРазвертке
	КорневаяСтрока = tsc_РаботаСФормулами.КореневаяСтрокаДереваПоВыражению(СтрокаДереваОперандовРодитель, СтруктураДопПараметров.КореньВыражения);
	
	ЕстьДокументВКорне = Ложь;
	// Если в корне составной тип данных, например, справочник и документ, то
	// выражение "Корень.Дата" - вернет дату и null в СКД. В алгоритме необходимо проверить тип значения.
	Если ТипЗнч(КорневаяСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
		ТипЗначенияКорня = КорневаяСтрока.ТипЗначения;
		Если ТипЗнч(ТипЗначенияКорня) = Тип("ОписаниеТипов") Тогда
			Для каждого Тип Из ТипЗначенияКорня.Типы() Цикл
				МД = Метаданные.НайтиПоТипу(Тип);
				Если МД = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если Метаданные.Документы.Содержит(МД) Тогда
					ЕстьДокументВКорне = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьДокументВКорне Тогда
		// Добавляем колонку для вычисления даты документа, т.к. алгоритмы периодические ("КДФ.", "КДС." и др.)
		СтрокаДереваАлгоритмов.Идентификатор = СтрокаДереваАлгоритмов.Идентификатор + "$" + СтруктураДопПараметров.КореньВыражения + ".Дата";
	КонецЕсли;
КонецПроцедуры

#Область ДобавлениеОператоровВДеревоОператоровДляКонструктораФормул

Процедура ПриПостроенииДереваОператоров(Дерево, Параметры, УникальныйИдентификатор) Экспорт
	
	Если Параметры.Свойство("ВыраженияСистемОбмена") И Параметры.ВыраженияСистемОбмена Тогда
		ДобавитьВыраженияСистемОбмена(Дерево);
	КонецЕсли;
	
	Если Параметры.Свойство("ФункцииДляПолученияЗначенийОбъектов") И Параметры.ФункцииДляПолученияЗначенийОбъектов Тогда
		ДобавитьФункцииДляПолученияЗначенийОбъектов(Дерево);
	КонецЕсли;
	
	Если Параметры.Свойство("ФункцииДляПолученияЗначенийКонстантТЦР") И Параметры.ФункцииДляПолученияЗначенийКонстантТЦР Тогда
		ДобавитьФункцииДляПолученияЗначенийКонстантТЦР(Дерево);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Процедура ДополнитьПараметрыПостроенияДереваОператоров(Параметры) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда
		Параметры.Вставить("ФункцииДляПолученияЗначенийОбъектов", Истина);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_УниверсальныйОбменДанными") Тогда
		Параметры.Вставить("ВыраженияСистемОбмена", Истина);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_УниверсальныйОбменДанными") Тогда
		Параметры.Вставить("ФункцииДляПолученияЗначенийКонстантТЦР", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьФункцииДляПолученияЗначенийОбъектов(Дерево)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеГруппыОператора = НСтр("ru = 'Функции БСП для получения свойств объектов';
										|en = 'SSL functions for obtaining properties of objects'");
	ГруппаОператоров = tsc_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "ФункцииБСПДляПолученияСвойствОбъектов", ПредставлениеГруппыОператора);
	
	
	ИдентификаторОператора = "ЗначениеРеквизитаОбъекта";
	ПредставлениеОператора = НСтр("ru = 'ЗначениеРеквизитаОбъекта(';
									|en = 'ObjectPropValue('");
	ПояснениеОператора = НСтр("ru = 'Получает значение реквизита объекта.';
								|en = 'Gets the value of an object's property.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("ОбщегоНазначения.ЗначениеРеквизитаОбъекта(<%1>, <%2>, <%3>, <%4>)", 
				Нстр("ru = 'Ссылка'"),
				Нстр("ru = 'Имя реквизита'"),
				Нстр("ru = 'Выбрать разрешенные'"),
				Нстр("ru = 'Код языка'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,	
		2);
		
	//
	ИдентификаторОператора = "ЗначениеРеквизитаОбъектов";
	ПредставлениеОператора = НСтр("ru = 'ЗначениеРеквизитаОбъектов(';
									|en = 'ObjectsPropValue('");
	ПояснениеОператора = НСтр("ru = 'Получает значение реквизита массива объектов.';
								|en = 'Gets the value of a prop of an array of objects.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("ОбщегоНазначения.ЗначениеРеквизитаОбъектов(<%1>, <%2>, <%3>, <%4>)", 
				Нстр("ru = 'Массив ссылок'"),
				Нстр("ru = 'Имя реквизита'"),
				Нстр("ru = 'Выбрать разрешенные'"),
				Нстр("ru = 'Код языка'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,	
		2);
		
	//
	ИдентификаторОператора = "ЗначенияРеквизитовОбъекта";
	ПредставлениеОператора = НСтр("ru = 'ЗначенияРеквизитовОбъекта(';
									|en = 'ObjectAttributesValues('");
	ПояснениеОператора = НСтр("ru = 'Получает значение реквизитов объекта.';
								|en = 'Gets the value of the object's attributes.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("ОбщегоНазначения.ЗначенияРеквизитовОбъекта(<%1>, <%2>, <%3>, <%4>)", 
				Нстр("ru = 'Ссылка'"),
				Нстр("ru = 'Реквизиты'"),
				Нстр("ru = 'Выбрать разрешенные'"),
				Нстр("ru = 'Код языка'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,	
		2);
	
	//
	ИдентификаторОператора = "ЗначенияРеквизитовОбъектов";
	ПредставлениеОператора = НСтр("ru = 'ЗначенияРеквизитовОбъектов(';
									|en = 'ObjectsAttributesValues('");
	ПояснениеОператора = НСтр("ru = 'Получает значение реквизитов массива объектов.';
								|en = 'Gets the value of the props of an array of objects.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("ОбщегоНазначения.ЗначенияРеквизитовОбъектов(<%1>, <%2>, <%3>, <%4>)", 
				Нстр("ru = 'Массив ссылок'"),
				Нстр("ru = 'Реквизиты'"),
				Нстр("ru = 'Выбрать разрешенные'"),
				Нстр("ru = 'Код языка'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,	
		2);
		
КонецПроцедуры

Процедура ДобавитьВыраженияСистемОбмена(Дерево) Экспорт
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ТЦР_УниверсальныйОбменДанными") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеГруппыОператора = НСтр("ru = 'Выражения систем обмена';
										|en = 'Expressions of exchange systems'");
	ГруппаОператоров = tsc_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "ВыраженияСистемОбмена", ПредставлениеГруппыОператора);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТЦР_УниверсальныйОбменДанными.АнализОшибокОбменов") Тогда
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ТЦР_РаботаСОшибкамиОбмена");
		СписокСистемОбмена = ОбщийМодуль.СписокСистемОбмена();
	Иначе
		СписокСистемОбмена = Новый СписокЗначений;
		ИмяСправочникКонстанты = "ТЦР_Константы";
		Выборка = Справочники[ИмяСправочникКонстанты].Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокСистемОбмена.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;
	КонецЕсли;
	Для каждого ЭлементСписка Из СписокСистемОбмена Цикл
		Система = ЭлементСписка.Значение;
		Предопределенный = Ложь;
		ИмяПредопределенныхДанных = "";
		Если ТипЗнч(Система) = Тип("Строка") Тогда
			// Обмен с документооборотом
			ИдентификаторОператора = Система;
		Иначе
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Система, "Предопределенный, ИмяПредопределенныхДанных");
			Предопределенный = ЗначенияРеквизитов.Предопределенный;
			ИмяПредопределенныхДанных = ЗначенияРеквизитов.ИмяПредопределенныхДанных;
			Если Предопределенный Тогда
				ИдентификаторОператора = ИмяПредопределенныхДанных;
			Иначе
				ИдентификаторОператора = ЭлементСписка.Представление;
			КонецЕсли;
		КонецЕсли;
		ПредставлениеОператора = ЭлементСписка.Представление;
		
		Если ТипЗнч(Система) = Тип("Строка") Тогда
			ОператорНаЯзыкеКодаДляВставки = СтрШаблон("""%1""", Система);
		Иначе
			СтрШаблон("Справочники.ТЦР_ИнтегрируемыеСистемы.%1", ИмяПредопределенныхДанных);
		КонецЕсли;
		ОператорНаЯзыкеКодаДляВставки = "Макс(,)";
		ПояснениеОператора = "";
		
		tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
			ИдентификаторОператора,
			ОператорНаЯзыкеКодаДляВставки,
			ПредставлениеОператора,
			ПояснениеОператора,
			2);
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ДобавитьФункцииДляПолученияЗначенийКонстантТЦР(Дерево)
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ТЦР_УниверсальныйОбменДанными") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеГруппыОператора = НСтр("ru = 'Функции для получения значений констант ТЦР';
										|en = 'Functions for obtaining the values of the TCR constants'");
	ГруппаОператоров = tsc_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "ФункцииДляПолученияЗначенийКонстантТЦР", ПредставлениеГруппыОператора);
	
	
	//
	ИдентификаторОператора = "ЗначениеКонстантыТЦР";
	ПредставлениеОператора = НСтр("ru = 'ЗначениеКонстантыТЦР(';
									|en = 'TheValueOfTheTCRConstant('");
	ПояснениеОператора = НСтр("ru = 'Получает значение константы ТЦР.';
								|en = 'Gets the value of the TCR constant.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("Справочники.ТЦР_Константы.ДанныеКонстанты(Справочники.ТЦР_Константы.<%1>).Значение", 
				Нстр("ru = 'Имя константы'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,
		2);
		
	//
	ИдентификаторОператора = "ТаблицаЗначенийКонстантыТЦР";
	ПредставлениеОператора = НСтр("ru = 'ТаблицаЗначенийКонстантыТЦР(';
									|en = 'TableOfValuesOfTheConstantOfTheTCR('");
	ПояснениеОператора = НСтр("ru = 'Получает таблицу значений константы ТЦР.';
								|en = 'Gets a table of values of the TCR constant.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("Справочники.ТЦР_Константы.ДанныеКонстанты(Справочники.ТЦР_Константы.<%1>).ТаблицаЗначений", 
				Нстр("ru = 'Имя константы'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,
		2);
	
	//
	ИдентификаторОператора = "СписокЗначенийКонстантыТЦР";
	ПредставлениеОператора = НСтр("ru = 'СписокЗначенийКонстантыТЦР(';
									|en = 'ListOfValuesOfTheConstantOfTheTCR('");
	ПояснениеОператора = НСтр("ru = 'Получает список значений константы ТЦР.';
								|en = 'Gets a list of values for the TCR constant.'");
	
	ОператорНаЯзыкеКодаДляВставки = СтрШаблон("Справочники.ТЦР_Константы.ДанныеКонстанты(Справочники.ТЦР_Константы.<%1>).Значения", 
				Нстр("ru = 'Имя константы'"));
	tsc_РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора,
		ПояснениеОператора,
		2);
		
КонецПроцедуры

#КонецОбласти

#Область АлгоритмыПолученияДанных

#Область ЗУП_КонструкторПечатныхФорм

// Процедура - Получить руководителя
//
// Параметры:
//  ТаблицаДанных					 - 	 - 
//  ИдентификаторАлгоритма			 - 	 - 
//  КолонкаРезультат				 - 	 - 
//  КолонкаИсточник					 - 	 - 
//  ДополнительныеВыраженияАлгоритма - 	 - 
//  Контекст						 - 	 - 
//  КешДанных						 - 	 - 
//  ТекстОшибки						 - 	 - 
//
Процедура ПолучитьРуководителя(ТаблицаДанных, ИдентификаторАлгоритма, КолонкаРезультат, КолонкаИсточник, ДополнительныеВыраженияАлгоритма, Контекст, КешДанных, ТекстОшибки = "") Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАлгоритма = СтрРазделить(ИдентификаторАлгоритма, "|");
	ТипРуководителяИдентификатор = ПараметрыАлгоритма[0];
	ТипРуководителя = Справочники["ТЦР_ТипыРуководителей"].НайтиПоРеквизиту("ИдентификаторДляФормул", ТипРуководителяИдентификатор);
	КолонкаЗапроса = ПараметрыАлгоритма[1]; 
	
	ПроверитьВКеше = Истина;
	Если КешДанных = Неопределено Тогда
		КешДанных = Новый ТаблицаЗначений;
		ПроверитьВКеше = Ложь;
	КонецЕсли;
	Если ТипЗнч(КешДанных) = Тип("ТаблицаЗначений") Тогда
		Если КешДанных.Колонки.Количество() = 0 Тогда
			ПроверитьВКеше = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	ИмяКолонкиДата = Неопределено;
	Если ДополнительныеВыраженияАлгоритма.Количество() > 0 Тогда
		СтруктураВыражениеКолонка = ДополнительныеВыраженияАлгоритма[0];
		ИмяКолонкиДата = СтруктураВыражениеКолонка.ИмяКолонки;
	КонецЕсли;
	
	СтрокиКЗапросу = Новый Массив;
	Если ПроверитьВКеше Тогда
		КешДанных.Индексы.Очистить();
		КешДанных.Индексы.Добавить("ОбъектРуководителя, ТипРуководителя, Дата");
		Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаИсточник]) Тогда
				Продолжить;
			КонецЕсли;
			Поиск = Новый Структура;
			Поиск.Вставить("ОбъектРуководителя", СтрокаТаблицы[КолонкаИсточник]);
			Поиск.Вставить("ТипРуководителя", ТипРуководителя);
			Если ИмяКолонкиДата = Неопределено Тогда
				Поиск.Вставить("Дата", ТекущаяДатаСеанса);
			Иначе
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонкиДата]) Тогда
					Поиск.Вставить("Дата", ТекущаяДатаСеанса);
				Иначе
					Поиск.Вставить("Дата", СтрокаТаблицы[ИмяКолонкиДата]);
				КонецЕсли;
			КонецЕсли;
			
			НайденныеСтроки = КешДанных.НайтиСтроки(Поиск);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокиКЗапросу.Добавить(СтрокаТаблицы);
			Иначе
				СтрокаТаблицы[КолонкаРезультат] = НайденныеСтроки[0][КолонкаЗапроса];
			КонецЕсли;
		КонецЦикла;
		КешДанных.Индексы.Очистить();
	КонецЕсли;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
	
		ТаблицаВЗапрос = Новый ТаблицаЗначений;
		ТаблицаВЗапрос.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
		ТаблицаВЗапрос.Колонки.Добавить("ОбъектРуководителя", Метаданные.РегистрыСведений["ТЦР_Руководители"].Измерения.ОбъектРуководителя.Тип);
		ТаблицаВЗапрос.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
	КонецЕсли;
	Если ПроверитьВКеше = Ложь Тогда
		Коллекциия = ТаблицаДанных;
	Иначе
		Коллекциия = СтрокиКЗапросу;
	КонецЕсли;
	Для каждого ИсходнаяСтрока Из Коллекциия Цикл
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[КолонкаИсточник]) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВЗапрос.Добавить();
		НоваяСтрока.ИндексСтроки = ИсходнаяСтрока.ИндексСтроки;
		НоваяСтрока.ОбъектРуководителя = ИсходнаяСтрока[КолонкаИсточник];
		Если ИмяКолонкиДата = Неопределено Тогда
			НоваяСтрока.Дата = ТекущаяДатаСеанса;
		Иначе
			НоваяСтрока.Дата = ИсходнаяСтрока[ИмяКолонкиДата];	
			Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[ИмяКолонкиДата]) Тогда
				НоваяСтрока.Дата = ТекущаяДатаСеанса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаВЗапрос", ТаблицаВЗапрос);
		Запрос.УстановитьПараметр("ВидСобытияУвольнение", Перечисления["ВидыКадровыхСобытий"].Увольнение);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектРуководителя КАК ОбъектРуководителя,
		|	Т.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаВЗапрос КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.ОбъектРуководителя,
		|	Т.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЦР_ТипыРуководителей.Ссылка КАК ТипРуководителя,
		|	ТЦР_ТипыРуководителей.Наименование КАК Наименование,
		|	ТЦР_ТипыРуководителей.Представление КАК Представление,
		|	ТЦР_ТипыРуководителей.Код КАК Код,
		|	ТЦР_ТипыРуководителей.ИдентификаторДляФормул КАК ИдентификаторДляФормул
		|ПОМЕСТИТЬ ТипыРуководителей
		|ИЗ
		|	Справочник.ТЦР_ТипыРуководителей КАК ТЦР_ТипыРуководителей
		|ГДЕ
		|	НЕ ТЦР_ТипыРуководителей.ПометкаУдаления
		|	И НЕ ТЦР_ТипыРуководителей.Архив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Период КАК Период,
		|	Рег.ОбъектРуководителя КАК ОбъектРуководителя,
		|	Рег.ТипРуководителя КАК ТипРуководителя,
		|	Рег.Руководитель КАК Руководитель
		|ПОМЕСТИТЬ Рег1
		|ИЗ
		|	РегистрСведений.ТЦР_Руководители КАК Рег
		|ГДЕ
		|	Рег.ОбъектРуководителя В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ.ОбъектРуководителя
		|			ИЗ
		|				ВТ КАК ВТ)
		|	И Рег.ТипРуководителя В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Т.ТипРуководителя
		|			ИЗ
		|				ТипыРуководителей КАК Т)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Рег.ОбъектРуководителя,
		|	Рег.ТипРуководителя,
		|	Рег.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектРуководителя КАК ОбъектРуководителя,
		|	Т.Дата КАК Дата,
		|	Т.ТипРуководителя КАК ТипРуководителя,
		|	Т.Наименование КАК Наименование,
		|	Т.Представление КАК Представление,
		|	Т.Код КАК Код,
		|	Т.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	МАКСИМУМ(Рег1.Руководитель) КАК Руководитель
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ.ИндексСтроки КАК ИндексСтроки,
		|		ВТ.ОбъектРуководителя КАК ОбъектРуководителя,
		|		ВТ.Дата КАК Дата,
		|		ТипыРуководителей.ТипРуководителя КАК ТипРуководителя,
		|		ТипыРуководителей.Наименование КАК Наименование,
		|		ТипыРуководителей.Представление КАК Представление,
		|		ТипыРуководителей.Код КАК Код,
		|		ТипыРуководителей.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|		МАКСИМУМ(Рег1.Период) КАК Период
		|	ИЗ
		|		ВТ КАК ВТ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Рег1 КАК Рег1
		|			ПО ВТ.ОбъектРуководителя = Рег1.ОбъектРуководителя
		|				И ВТ.Дата >= Рег1.Период
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыРуководителей КАК ТипыРуководителей
		|			ПО (Рег1.ТипРуководителя = ТипыРуководителей.ТипРуководителя)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ.ИндексСтроки,
		|		ВТ.ОбъектРуководителя,
		|		ВТ.Дата,
		|		ТипыРуководителей.ТипРуководителя,
		|		ТипыРуководителей.Наименование,
		|		ТипыРуководителей.Представление,
		|		ТипыРуководителей.Код,
		|		ТипыРуководителей.ИдентификаторДляФормул) КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Рег1 КАК Рег1
		|		ПО Т.ОбъектРуководителя = Рег1.ОбъектРуководителя
		|			И Т.ТипРуководителя = Рег1.ТипРуководителя
		|			И Т.Период = Рег1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ИндексСтроки,
		|	Т.ОбъектРуководителя,
		|	Т.Дата,
		|	Т.ТипРуководителя,
		|	Т.Наименование,
		|	Т.Представление,
		|	Т.Код,
		|	Т.ИдентификаторДляФормул
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Руководитель,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДляПодбораСотрудников.Наименование КАК Наименование,
		|	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник,
		|	ДанныеДляПодбораСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеДляПодбораСотрудников.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	ДанныеДляПодбораСотрудников.ПоДоговоруГПХ КАК ПоДоговоруГПХ,
		|	ДанныеДляПодбораСотрудников.Филиал КАК Филиал,
		|	ДанныеДляПодбораСотрудников.Подразделение КАК Подразделение,
		|	ДанныеДляПодбораСотрудников.Организация КАК Организация,
		|	ДанныеДляПодбораСотрудников.Должность КАК Должность,
		|	ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ДанныеДляПодбораСотрудников.РабочееМесто КАК РабочееМесто,
		|	ДанныеДляПодбораСотрудников.ЭтоГоловнойСотрудник КАК ЭтоГоловнойСотрудник,
		|	ДанныеДляПодбораСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ДанныеДляПодбораСотрудников.ВидСобытия КАК ВидСобытия,
		|	ДанныеДляПодбораСотрудников.КоличествоСтавок КАК КоличествоСтавок,
		|	ДанныеДляПодбораСотрудников.КоличествоСтавокПредставление КАК КоличествоСтавокПредставление,
		|	ДанныеДляПодбораСотрудников.ВидДоговора КАК ВидДоговора,
		|	ДанныеДляПодбораСотрудников.Начало КАК Начало,
		|	ДанныеДляПодбораСотрудников.Окончание КАК Окончание,
		|	ДанныеДляПодбораСотрудников.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
		|	ДанныеДляПодбораСотрудников.ПометкаУдаления КАК ПометкаУдаления,
		|	ДанныеДляПодбораСотрудников.Код КАК Код,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ Рег2
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
		|ГДЕ
		|	(ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ2.Руководитель
		|				ИЗ
		|					ВТ2 КАК ВТ2
		|				ГДЕ
		|					ВТ2.Руководитель ССЫЛКА Справочник.ШтатноеРасписание)
		|			ИЛИ ДанныеДляПодбораСотрудников.Сотрудник В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ2.Руководитель
		|				ИЗ
		|					ВТ2 КАК ВТ2
		|				ГДЕ
		|					ВТ2.Руководитель ССЫЛКА Справочник.Сотрудники))
		|	И ДанныеДляПодбораСотрудников.ВидСобытия <> &ВидСобытияУвольнение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Окончание,
		|	Окончание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектРуководителя КАК ОбъектРуководителя,
		|	Т.Дата КАК Дата,
		|	Т.ТипРуководителя КАК ТипРуководителя,
		|	Т.ТипРуководителя.Зависимый КАК ЗависимыйТип,
		|	Т.ТипРуководителя.ВышестоящийТипРуководителя КАК ВышестоящийТипРуководителя,
		|	Т.Наименование КАК Наименование,
		|	Т.Представление КАК Представление,
		|	Т.Код КАК Код,
		|	Т.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	Т.Руководитель КАК Руководитель,  
		|	Т.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА Рег2.ДолжностьПоШтатномуРасписанию ЕСТЬ NULL
		|			ТОГДА Т.Руководитель.Наименование
		|		ИНАЧЕ Т.Сотрудник.Наименование
		|	КОНЕЦ КАК Значение,
		|	ЕСТЬNULL(Рег2.ДолжностьПоШтатномуРасписанию, """") КАК ДолжностьПоШтатномуРасписанию,
		|	ЕСТЬNULL(Рег2.Должность, """") КАК Должность,
		|	ЕСТЬNULL(Рег2.ФизическоеЛицо.ФИО, """") КАК ФИО,
		|	ЕСТЬNULL(Рег2.ФизическоеЛицо.Фамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(Рег2.ФизическоеЛицо.Имя, """") КАК Имя,
		|	ЕСТЬNULL(Рег2.ФизическоеЛицо.Отчество, """") КАК Отчество,
		|	ЕСТЬNULL(Рег2.ФизическоеЛицо.Инициалы, """") КАК Инициалы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ2.ИндексСтроки КАК ИндексСтроки,
		|		ВТ2.ОбъектРуководителя КАК ОбъектРуководителя,
		|		ВТ2.Дата КАК Дата,
		|		ВТ2.ТипРуководителя КАК ТипРуководителя,
		|		ВТ2.Наименование КАК Наименование,
		|		ВТ2.Представление КАК Представление,
		|		ВТ2.Код КАК Код,
		|		ВТ2.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|		ВТ2.Руководитель КАК Руководитель,
		|		МАКСИМУМ(Рег2.Сотрудник) КАК Сотрудник
		|	ИЗ
		|		ВТ2 КАК ВТ2
		|			ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2
		|			ПО (ВТ2.Руководитель = Рег2.Сотрудник
		|					ИЛИ ВТ2.Руководитель = Рег2.ДолжностьПоШтатномуРасписанию)
		|				И (ВТ2.Дата МЕЖДУ Рег2.Начало И Рег2.Окончание)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ2.ИндексСтроки,
		|		ВТ2.ОбъектРуководителя,
		|		ВТ2.Дата,
		|		ВТ2.ТипРуководителя,
		|		ВТ2.Наименование,
		|		ВТ2.Представление,
		|		ВТ2.Код,
		|		ВТ2.ИдентификаторДляФормул,
		|		ВТ2.Руководитель) КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2
		|		ПО Т.Сотрудник = Рег2.Сотрудник
		|			И Т.Дата <= Рег2.Окончание
		|			И Т.Дата >= Рег2.Начало
		|ГДЕ
		|	(Рег2.НомерЗаписи ЕСТЬ NULL
		|	ИЛИ Рег2.НомерЗаписи В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				Р.НомерЗаписи
		|			ИЗ
		|				Рег2 КАК Р
		|			ГДЕ
		|				Т.Сотрудник = Р.Сотрудник
		|				И Т.Дата <= Р.Окончание
		|				И Т.Дата >= Р.Начало
		|			УПОРЯДОЧИТЬ ПО
		|				Р.Окончание УБЫВ,
		|				Р.Начало УБЫВ))";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		
		ТаблицаДанных.Индексы.Очистить();
		ТаблицаДанных.Индексы.Добавить("ИндексСтроки");
		Если НЕ ПроверитьВКеше Тогда
			КешДанных = Таблица;
		КонецЕсли;
		
		Если ПроверитьВКеше Тогда
			КешДанных.Индексы.Очистить();
			КешДанных.Индексы.Добавить("ОбъектРуководителя, Дата, ТипРуководителя");
		КонецЕсли;
			
		// Таблица получена по текущей ТаблицаДанных, так что можем искать строки по ИндексСтроки
		Для каждого Строка Из Таблица Цикл
			Если Строка.ТипРуководителя = ТипРуководителя Тогда
				ИндексСтроки = Строка.ИндексСтроки;
				ИсходнаяСтрока = ТаблицаДанных.Найти(ИндексСтроки, "ИндексСтроки");
				Если НЕ ИсходнаяСтрока = Неопределено Тогда
					ИсходнаяСтрока[КолонкаРезультат] = Строка[КолонкаЗапроса];
				КонецЕсли;
			КонецЕсли;
			
			Если ПроверитьВКеше Тогда
				ПоискПоКешу = Новый Структура("ОбъектРуководителя, Дата, ТипРуководителя");
				ЗаполнитьЗначенияСвойств(ПоискПоКешу, Строка);
				НайдСтрокиКеша = КешДанных.НайтиСтроки(ПоискПоКешу);
				Если НайдСтрокиКеша.Количество() = 0 Тогда 
					СтрокаКеша = КешДанных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаКеша, Строка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		ТаблицаДанных.Индексы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьПодписанта(ТаблицаДанных, ИдентификаторАлгоритма, КолонкаРезультат, КолонкаИсточник, ДополнительныеВыраженияАлгоритма, Контекст, КешДанных, ТекстОшибки = "") Экспорт 

	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАлгоритма = СтрРазделить(ИдентификаторАлгоритма, "|");
	ТипПодписантаИдентификатор = ПараметрыАлгоритма[0];
	ТипПодписанта = Справочники["ТЦР_ТипыПодписантов"].НайтиПоРеквизиту("ИдентификаторДляФормул", ТипПодписантаИдентификатор);
	КолонкаЗапроса = ПараметрыАлгоритма[1]; 
	
	ПроверитьВКеше = Истина;
	Если КешДанных = Неопределено Тогда
		КешДанных = Новый ТаблицаЗначений;
		ПроверитьВКеше = Ложь;
	КонецЕсли;
	Если ТипЗнч(КешДанных) = Тип("ТаблицаЗначений") Тогда
		Если КешДанных.Колонки.Количество() = 0 Тогда
			ПроверитьВКеше = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	ИмяКолонкиДата = Неопределено;
	Если ДополнительныеВыраженияАлгоритма.Количество() > 0 Тогда
		СтруктураВыражениеКолонка = ДополнительныеВыраженияАлгоритма[0];
		ИмяКолонкиДата = СтруктураВыражениеКолонка.ИмяКолонки;
	КонецЕсли;
	
	СтрокиКЗапросу = Новый Массив;
	Если ПроверитьВКеше Тогда
		КешДанных.Индексы.Очистить();
		КешДанных.Индексы.Добавить("ОбъектПодписанта, ТипПодписанта, Дата");
		Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаИсточник]) Тогда
				Продолжить;
			КонецЕсли;
			Поиск = Новый Структура;
			Поиск.Вставить("ОбъектПодписанта", СтрокаТаблицы[КолонкаИсточник]);
			Поиск.Вставить("ТипПодписанта", ТипПодписанта);
			Если ИмяКолонкиДата = Неопределено Тогда
				Поиск.Вставить("Дата", ТекущаяДатаСеанса);
			Иначе
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонкиДата]) Тогда
					Поиск.Вставить("Дата", ТекущаяДатаСеанса);
				Иначе
					Поиск.Вставить("Дата", СтрокаТаблицы[ИмяКолонкиДата]);
				КонецЕсли;
			КонецЕсли;
			
			НайденныеСтроки = КешДанных.НайтиСтроки(Поиск);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокиКЗапросу.Добавить(СтрокаТаблицы);
			Иначе
				СтрокаТаблицы[КолонкаРезультат] = НайденныеСтроки[0][КолонкаЗапроса];	
			КонецЕсли;
		КонецЦикла;
		КешДанных.Индексы.Очистить();
	КонецЕсли;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
	
		ТаблицаВЗапрос = Новый ТаблицаЗначений;
		ТаблицаВЗапрос.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
		ТаблицаВЗапрос.Колонки.Добавить("ОбъектПодписанта", Метаданные.РегистрыСведений["ТЦР_Подписанты"].Измерения.ОбъектПодписанта.Тип);
		ТаблицаВЗапрос.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
	КонецЕсли;
	Если ПроверитьВКеше = Ложь Тогда
		Коллекциия = ТаблицаДанных;
	Иначе
		Коллекциия = СтрокиКЗапросу;
	КонецЕсли;
	Для каждого ИсходнаяСтрока Из Коллекциия Цикл
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[КолонкаИсточник]) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВЗапрос.Добавить();
		НоваяСтрока.ИндексСтроки = ИсходнаяСтрока.ИндексСтроки;
		НоваяСтрока.ОбъектПодписанта = ИсходнаяСтрока[КолонкаИсточник];
		Если ИмяКолонкиДата = Неопределено Тогда
			НоваяСтрока.Дата = ТекущаяДатаСеанса;
		Иначе
			НоваяСтрока.Дата = ИсходнаяСтрока[ИмяКолонкиДата];	
			Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[ИмяКолонкиДата]) Тогда
				НоваяСтрока.Дата = ТекущаяДатаСеанса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
		
		МодульТЦР_Подписанты = ОбщегоНазначения.ОбщийМодуль("ТЦР_Подписанты");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаВЗапрос", ТаблицаВЗапрос);
		Запрос.УстановитьПараметр("СостоянияОтсутствияСотрудников", МодульТЦР_Подписанты.СостоянияОтсутствияСотрудников());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектПодписанта КАК ОбъектПодписанта,
		|	Т.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаВЗапрос КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.ОбъектПодписанта,
		|	Т.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ   
		|	ТЦР_ТипыПодписантов.Ссылка КАК ТипПодписанта,
		|	ТЦР_ТипыПодписантов.Наименование КАК Наименование,
		|	ТЦР_ТипыПодписантов.Представление КАК Представление,
		|	ТЦР_ТипыПодписантов.Код КАК Код,
		|	ТЦР_ТипыПодписантов.ИдентификаторДляФормул КАК ИдентификаторДляФормул
		|ПОМЕСТИТЬ ТипыПодписантов
		|ИЗ
		|	Справочник.ТЦР_ТипыПодписантов КАК ТЦР_ТипыПодписантов
		|ГДЕ
		|	НЕ ТЦР_ТипыПодписантов.Архив
		|	И НЕ ТЦР_ТипыПодписантов.ПометкаУдаления
		|ИНДЕКСИРОВАТЬ ПО
		|	ТЦР_ТипыПодписантов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Период КАК Период,
		|	Рег.ОбъектПодписанта КАК ОбъектПодписанта,
		|	Рег.ТипПодписанта КАК ТипПодписанта,
		|	Рег.Подписант КАК Подписант,
		|	Рег.Должность КАК Должность,
		|	Рег.ОснованиеПодписиПодписант КАК ОснованиеПодписиПодписант,
		|	Рег.Заместитель КАК Заместитель,
		|	Рег.ДолжностьЗаместитель КАК ДолжностьЗаместитель,
		|	Рег.ОснованиеПодписиЗаместитель КАК ОснованиеПодписиЗаместитель
		|ПОМЕСТИТЬ Рег1
		|ИЗ
		|	РегистрСведений.ТЦР_Подписанты КАК Рег
		|ГДЕ
		|	Рег.ОбъектПодписанта В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ.ОбъектПодписанта
		|			ИЗ
		|				ВТ КАК ВТ)
		|	И Рег.ТипПодписанта В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Т.ТипПодписанта
		|			ИЗ
		|				ТипыПодписантов КАК Т)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Рег.ОбъектПодписанта,
		|	Рег.ТипПодписанта,
		|	Рег.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектПодписанта КАК ОбъектПодписанта,
		|	Т.Дата КАК Дата,
		|	Т.ТипПодписанта КАК ТипПодписанта,
		|	Т.Наименование КАК Наименование,
		|	Т.Представление КАК Представление,
		|	Т.Код КАК Код,
		|	Т.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	(Рег1.Подписант) КАК Подписант,
		|	(Рег1.Должность) КАК Должность,
		|	(Рег1.ОснованиеПодписиПодписант) КАК ОснованиеПодписиПодписант,
		|	(Рег1.Заместитель) КАК Заместитель,
		|	(Рег1.ДолжностьЗаместитель) КАК ДолжностьЗаместитель,
		|	(Рег1.ОснованиеПодписиЗаместитель) КАК ОснованиеПодписиЗаместитель
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ.ИндексСтроки КАК ИндексСтроки,
		|		ВТ.ОбъектПодписанта КАК ОбъектПодписанта,
		|		ВТ.Дата КАК Дата,
		|		ТипыПодписантов.ТипПодписанта КАК ТипПодписанта,
		|		ТипыПодписантов.Наименование КАК Наименование,
		|		ТипыПодписантов.Представление КАК Представление,
		|		ТипыПодписантов.Код КАК Код,
		|		ТипыПодписантов.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|		МАКСИМУМ(Рег1.Период) КАК Период
		|	ИЗ
		|		ВТ КАК ВТ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Рег1 КАК Рег1
		|			ПО ВТ.ОбъектПодписанта = Рег1.ОбъектПодписанта
		|				И ВТ.Дата >= Рег1.Период
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыПодписантов КАК ТипыПодписантов
		|			ПО (Рег1.ТипПодписанта = ТипыПодписантов.ТипПодписанта)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ.ИндексСтроки,
		|		ВТ.ОбъектПодписанта,
		|		ВТ.Дата,
		|		ТипыПодписантов.ТипПодписанта,
		|		ТипыПодписантов.Наименование,
		|		ТипыПодписантов.Представление,
		|		ТипыПодписантов.Код,
		|		ТипыПодписантов.ИдентификаторДляФормул) КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Рег1 КАК Рег1
		|		ПО Т.ОбъектПодписанта = Рег1.ОбъектПодписанта
		|			И Т.ТипПодписанта = Рег1.ТипПодписанта
		|			И Т.Период = Рег1.Период
		|
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подписант,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДляПодбораСотрудников.Наименование КАК Наименование,
		|	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник,
		|	ДанныеДляПодбораСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеДляПодбораСотрудников.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	ДанныеДляПодбораСотрудников.ПоДоговоруГПХ КАК ПоДоговоруГПХ,
		|	ДанныеДляПодбораСотрудников.Филиал КАК Филиал,
		|	ДанныеДляПодбораСотрудников.Подразделение КАК Подразделение,
		|	ДанныеДляПодбораСотрудников.Организация КАК Организация,
		|	ДанныеДляПодбораСотрудников.Должность КАК Должность,
		|	ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ДанныеДляПодбораСотрудников.РабочееМесто КАК РабочееМесто,
		|	ДанныеДляПодбораСотрудников.ЭтоГоловнойСотрудник КАК ЭтоГоловнойСотрудник,
		|	ДанныеДляПодбораСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ДанныеДляПодбораСотрудников.ВидСобытия КАК ВидСобытия,
		|	ДанныеДляПодбораСотрудников.КоличествоСтавок КАК КоличествоСтавок,
		|	ДанныеДляПодбораСотрудников.КоличествоСтавокПредставление КАК КоличествоСтавокПредставление,
		|	ДанныеДляПодбораСотрудников.ВидДоговора КАК ВидДоговора,
		|	ДанныеДляПодбораСотрудников.Начало КАК Начало,
		|	ДанныеДляПодбораСотрудников.Окончание КАК Окончание,
		|	ДанныеДляПодбораСотрудников.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
		|	ДанныеДляПодбораСотрудников.ПометкаУдаления КАК ПометкаУдаления,
		|	ДанныеДляПодбораСотрудников.Код КАК Код,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ Рег2
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
		|ГДЕ
		|	(ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ2.Подписант
		|				ИЗ
		|					ВТ2 КАК ВТ2
		|				ГДЕ
		|					ВТ2.Подписант ССЫЛКА Справочник.ШтатноеРасписание)
		|			ИЛИ ДанныеДляПодбораСотрудников.Сотрудник В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ2.Подписант
		|				ИЗ
		|					ВТ2 КАК ВТ2
		|				ГДЕ
		|					ВТ2.Подписант ССЫЛКА Справочник.Сотрудники))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Окончание,
		|	Окончание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.ОбъектПодписанта КАК ОбъектПодписанта,
		|	Т.Дата КАК Дата,
		|	Т.ТипПодписанта КАК ТипПодписанта,
		|	Т.Наименование КАК Наименование,
		|	Т.Представление КАК Представление,
		|	Т.Код КАК Код,
		|	Т.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	Т.Подписант КАК Подписант,
		|	Т.Должность КАК Должность,
		|	Т.ОснованиеПодписиПодписант КАК ОснованиеПодписиПодписант,
		|	Т.Заместитель КАК Заместитель,
		|	Т.ДолжностьЗаместитель КАК ДолжностьЗаместитель,
		|	Т.ОснованиеПодписиЗаместитель КАК ОснованиеПодписиЗаместитель,
		|	Т.Сотрудник КАК Сотрудник,
		|	Т.ЗаместительСотр КАК ЗаместительСотр,
		|	Рег2П.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Рег2З.ФизическоеЛицо КАК ФизическоеЛицоЗаместитель
		|ПОМЕСТИТЬ ВТПодписантыБезУчетаОтсутствий
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ2.ИндексСтроки КАК ИндексСтроки,
		|		ВТ2.ОбъектПодписанта КАК ОбъектПодписанта,
		|		ВТ2.Дата КАК Дата,
		|		ВТ2.ТипПодписанта КАК ТипПодписанта,
		|		ВТ2.Наименование КАК Наименование,
		|		ВТ2.Представление КАК Представление,
		|		ВТ2.Код КАК Код,
		|		ВТ2.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|		ВТ2.Подписант КАК Подписант,
		|		ВТ2.Должность КАК Должность,
		|		ВТ2.ОснованиеПодписиПодписант КАК ОснованиеПодписиПодписант,
		|		ВТ2.Заместитель КАК Заместитель,
		|		ВТ2.ДолжностьЗаместитель КАК ДолжностьЗаместитель,
		|		ВТ2.ОснованиеПодписиЗаместитель КАК ОснованиеПодписиЗаместитель,
		|		МАКСИМУМ(Рег2П.Сотрудник) КАК Сотрудник,
		|		МАКСИМУМ(Рег2З.Сотрудник) КАК ЗаместительСотр
		|	ИЗ
		|		ВТ2 КАК ВТ2
		|			ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2П
		|			ПО (ВТ2.Подписант = Рег2П.Сотрудник
		|					ИЛИ ВТ2.Подписант = Рег2П.ДолжностьПоШтатномуРасписанию)
		|				И (ВТ2.Дата МЕЖДУ Рег2П.Начало И Рег2П.Окончание)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2З
		|			ПО (ВТ2.Заместитель = Рег2З.Сотрудник
		|					ИЛИ ВТ2.Заместитель = Рег2З.ДолжностьПоШтатномуРасписанию)
		|				И (ВТ2.Дата МЕЖДУ Рег2З.Начало И Рег2З.Окончание)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ2.ИндексСтроки,
		|		ВТ2.ОбъектПодписанта,
		|		ВТ2.Дата,
		|		ВТ2.ТипПодписанта,
		|		ВТ2.Наименование,
		|		ВТ2.Представление,
		|		ВТ2.Код,
		|		ВТ2.ИдентификаторДляФормул,
		|		ВТ2.Подписант,
		|		ВТ2.Должность,
		|		ВТ2.ОснованиеПодписиПодписант,
		|		ВТ2.Заместитель,
		|		ВТ2.ДолжностьЗаместитель,
		|		ВТ2.ОснованиеПодписиЗаместитель) КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2П
		|		ПО Т.Сотрудник = Рег2П.Сотрудник
		|			И Т.Дата <= Рег2П.Окончание
		|			И Т.Дата >= Рег2П.Начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ Рег2 КАК Рег2З
		|		ПО Т.Заместитель = Рег2З.Сотрудник
		|			И Т.Дата <= Рег2З.Окончание
		|			И Т.Дата >= Рег2З.Начало
		|ГДЕ
		|	(Рег2П.НомерЗаписи ЕСТЬ NULL	
		|	ИЛИ Рег2П.НомерЗаписи В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				Р.НомерЗаписи
		|			ИЗ
		|				Рег2 КАК Р
		|			ГДЕ
		|				Т.Сотрудник = Р.Сотрудник
		|				И Т.Дата <= Р.Окончание
		|				И Т.Дата >= Р.Начало
		|			УПОРЯДОЧИТЬ ПО
		|				Р.Окончание УБЫВ,
		|				Р.Начало УБЫВ))
		|	И (Рег2З.НомерЗаписи ЕСТЬ NULL
		|		ИЛИ Рег2З.НомерЗаписи В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				Р.НомерЗаписи
		|			ИЗ
		|				Рег2 КАК Р
		|			ГДЕ
		|				Т.Заместитель = Р.Сотрудник
		|				И Т.Дата <= Р.Окончание
		|				И Т.Дата >= Р.Начало
		|			УПОРЯДОЧИТЬ ПО
		|				Р.Окончание УБЫВ,
		|				Р.Начало УБЫВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПодписантыБезУчетаОтсутствий.ИндексСтроки КАК ИндексСтроки,
		|	ВТПодписантыБезУчетаОтсутствий.ОбъектПодписанта КАК ОбъектПодписанта,
		|	ВТПодписантыБезУчетаОтсутствий.Дата КАК Дата,
		|	ВТПодписантыБезУчетаОтсутствий.Подписант КАК ПодписантПлан,
		|	ВТПодписантыБезУчетаОтсутствий.Заместитель КАК ЗаместительПлан,
		|	ВТПодписантыБезУчетаОтсутствий.ТипПодписанта КАК ТипПодписанта,
		|	ВТПодписантыБезУчетаОтсутствий.Наименование КАК Наименование,
		|	ВТПодписантыБезУчетаОтсутствий.Представление КАК Представление,
		|	ВТПодписантыБезУчетаОтсутствий.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	ВЫРАЗИТЬ(ВТПодписантыБезУчетаОтсутствий.ТипПодписанта КАК Справочник.ТЦР_ТипыПодписантов).Наименование КАК НаименованиеТипа,
		|	ВТПодписантыБезУчетаОтсутствий.ОснованиеПодписиПодписант КАК ОснованиеПодписиПодписант,
		|	ВТПодписантыБезУчетаОтсутствий.ОснованиеПодписиЗаместитель КАК ОснованиеПодписиЗаместитель,
		|	ВЫБОР
		|		КОГДА СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПодписантОтсутствует,
		|	ВЫБОР
		|		КОГДА СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаместительОтсутствует,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.Должность
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ДолжностьЗаместитель
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Должность,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Подписант,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ОснованиеПодписиПодписант
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ОснованиеПодписиЗаместитель
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК ОснованиеПодписи,
		|	ВЫРАЗИТЬ(ВТПодписантыБезУчетаОтсутствий.ТипПодписанта КАК Справочник.ТЦР_ТипыПодписантов).Код КАК Код,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицо.ФИО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицоЗаместитель.ФИО
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК ФИО,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицо.Фамилия
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицоЗаместитель.Фамилия
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Фамилия,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицо.Имя
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицоЗаместитель.Имя
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Имя,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицо.Отчество
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицоЗаместитель.Отчество
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Отчество,
		|	ВЫБОР
		|		КОГДА ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицо.Инициалы
		|		КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.Сотрудник ЕСТЬ NULL
		|				И НЕ СостоянияСотрудников.Сотрудник ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|							И СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|						ТОГДА ВТПодписантыБезУчетаОтсутствий.ФизическоеЛицоЗаместитель.Инициалы
		|					КОГДА НЕ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|								И НЕ СостоянияСотрудниковЗаместитель.Сотрудник ЕСТЬ NULL
		|							ИЛИ ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр ЕСТЬ NULL
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|	КОНЕЦ КАК Инициалы
		|ИЗ
		|	ВТПодписантыБезУчетаОтсутствий КАК ВТПодписантыБезУчетаОтсутствий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ПО ВТПодписантыБезУчетаОтсутствий.Сотрудник = СостоянияСотрудников.Сотрудник
		|			И (ВТПодписантыБезУчетаОтсутствий.Дата <= СостоянияСотрудников.ДействуетДо)
		|			И (ВТПодписантыБезУчетаОтсутствий.Дата >= СостоянияСотрудников.Период)
		|			И (СостоянияСотрудников.Состояние В (&СостоянияОтсутствияСотрудников))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудниковЗаместитель
		|		ПО ВТПодписантыБезУчетаОтсутствий.ЗаместительСотр = СостоянияСотрудниковЗаместитель.Сотрудник
		|			И (ВТПодписантыБезУчетаОтсутствий.Дата <= СостоянияСотрудниковЗаместитель.ДействуетДо)
		|			И (ВТПодписантыБезУчетаОтсутствий.Дата >= СостоянияСотрудниковЗаместитель.Период)
		|			И (СостоянияСотрудниковЗаместитель.Состояние В (&СостоянияОтсутствияСотрудников))";    
		
		
		Таблица = Запрос.Выполнить().Выгрузить();
		
		ТаблицаДанных.Индексы.Очистить();
		ТаблицаДанных.Индексы.Добавить("ИндексСтроки");
		Если НЕ ПроверитьВКеше Тогда
			КешДанных = Таблица;
		КонецЕсли;
		Если ПроверитьВКеше Тогда
			КешДанных.Индексы.Очистить();
			КешДанных.Индексы.Добавить("ОбъектПодписанта, Дата, ТипПодписанта");
		КонецЕсли;
			
		// Таблица получена по текущей ТаблицаДанных, так что можем искать строки по ИндексСтроки
		Для каждого Строка Из Таблица Цикл
			Если Строка.ТипПодписанта = ТипПодписанта Тогда
				ИндексСтроки = Строка.ИндексСтроки;
				ИсходнаяСтрока = ТаблицаДанных.Найти(ИндексСтроки, "ИндексСтроки");
				Если НЕ ИсходнаяСтрока = Неопределено Тогда
					ИсходнаяСтрока[КолонкаРезультат] = Строка[КолонкаЗапроса];
				КонецЕсли;
			КонецЕсли;
			
			Если ПроверитьВКеше Тогда
				ПоискВКеше = Новый Структура("ОбъектПодписанта, Дата, ТипПодписанта");
				ЗаполнитьЗначенияСвойств(ПоискВКеше, Строка);
				НайдСтрокиКеша = КешДанных.НайтиСтроки(ПоискВКеше);
				Если НайдСтрокиКеша.Количество() = 0 Тогда
					СтрокаКеша = КешДанных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаКеша, Строка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		ТаблицаДанных.Индексы.Очистить();
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ПолучитьОтветственноеЛицо(ТаблицаДанных, ИдентификаторАлгоритма, КолонкаРезультат, КолонкаИсточник, ДополнительныеВыраженияАлгоритма, Контекст, КешДанных, ТекстОшибки = "") Экспорт 
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ТЦР_КонструкторПечатныхФорм") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАлгоритма = СтрРазделить(ИдентификаторАлгоритма, "|");
	Код = ПараметрыАлгоритма[0];
	КолонкаЗапроса = ПараметрыАлгоритма[1]; 
	
	ПроверитьВКеше = Истина;
	Если КешДанных = Неопределено Тогда
		КешДанных = Новый ТаблицаЗначений;
		ПроверитьВКеше = Ложь;
	КонецЕсли;
	Если ТипЗнч(КешДанных) = Тип("ТаблицаЗначений") Тогда
		Если КешДанных.Колонки.Количество() = 0 Тогда
			ПроверитьВКеше = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	ИмяКолонкиДата = Неопределено;
	Если ДополнительныеВыраженияАлгоритма.Количество() > 0 Тогда
		СтруктураВыражениеКолонка = ДополнительныеВыраженияАлгоритма[0];
		ИмяКолонкиДата = СтруктураВыражениеКолонка.ИмяКолонки;
	КонецЕсли;
	
	СтрокиКЗапросу = Новый Массив;
	Если ПроверитьВКеше Тогда
		КешДанных.Индексы.Очистить();
		КешДанных.Индексы.Добавить("Организация, Код, Дата");
		Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаИсточник]) Тогда
				Продолжить;
			КонецЕсли;
			Поиск = Новый Структура;
			Поиск.Вставить("Организация", СтрокаТаблицы[КолонкаИсточник]);
			Поиск.Вставить("Код", Код);
			Если ИмяКолонкиДата = Неопределено Тогда
				Поиск.Вставить("Дата", ТекущаяДатаСеанса);
			Иначе
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонкиДата]) Тогда
					Поиск.Вставить("Дата", ТекущаяДатаСеанса);
				Иначе
					Поиск.Вставить("Дата", СтрокаТаблицы[ИмяКолонкиДата]);
				КонецЕсли;
			КонецЕсли;
			
			НайденныеСтроки = КешДанных.НайтиСтроки(Поиск);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокиКЗапросу.Добавить(СтрокаТаблицы);
			Иначе
				СтрокаТаблицы[КолонкаРезультат] = НайденныеСтроки[0][КолонкаЗапроса];
			КонецЕсли;
		КонецЦикла;
		КешДанных.Индексы.Очистить();
	КонецЕсли;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
	
		ТаблицаВЗапрос = Новый ТаблицаЗначений;
		ТаблицаВЗапрос.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
		ТаблицаВЗапрос.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТаблицаВЗапрос.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
	КонецЕсли;
	Если ПроверитьВКеше = Ложь Тогда
		Коллекциия = ТаблицаДанных;
	Иначе
		Коллекциия = СтрокиКЗапросу;
	КонецЕсли;
	Для каждого ИсходнаяСтрока Из Коллекциия Цикл
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[КолонкаИсточник]) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВЗапрос.Добавить();
		НоваяСтрока.ИндексСтроки = ИсходнаяСтрока.ИндексСтроки;
		НоваяСтрока.Организация = ИсходнаяСтрока[КолонкаИсточник];
		Если ИмяКолонкиДата = Неопределено Тогда
			НоваяСтрока.Дата = ТекущаяДатаСеанса;
		Иначе
			НоваяСтрока.Дата = ИсходнаяСтрока[ИмяКолонкиДата];	
			Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока[ИмяКолонкиДата]) Тогда
				НоваяСтрока.Дата = ТекущаяДатаСеанса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверитьВКеше = Ложь
		ИЛИ СтрокиКЗапросу.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаВЗапрос", ТаблицаВЗапрос);
		Запрос.УстановитьПараметр("ФизическиеЛица_ПустаяСсылка", Справочники["ФизическиеЛица"].ПустаяСсылка());
	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ИндексСтроки КАК ИндексСтроки,
		|	Т.Организация КАК Организация,
		|	Т.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаВЗапрос КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т.Организация,
		|	Т.Дата
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Руководитель"" КАК Код
		|ПОМЕСТИТЬ ВТ_Коды
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ВыбранныйПодписант""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ГлавныйБухгалтер""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Кассир""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РуководительКадровойСлужбы""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ОтветственныйЗаВУР""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ОтветственныйЗаОхрануТруда""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПредставительСФР""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рег.Период КАК Период,
		|	Рег.Организация КАК Организация,
		|	Рег.Руководитель КАК Руководитель,
		|	Рег.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	Рег.Кассир КАК Кассир,
		|	Рег.РуководительКадровойСлужбы КАК РуководительКадровойСлужбы,
		|	Рег.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР,
		|	Рег.ОтветственныйЗаОхрануТруда КАК ОтветственныйЗаОхрануТруда,
		|	Рег.ПредставительСФР КАК ПредставительСФР
		|ПОМЕСТИТЬ Рег1
		|ИЗ
		|	РегистрСведений.СведенияОбОтветственныхЛицах КАК Рег
		|ГДЕ
		|	Рег.Организация В (ВЫБРАТЬ ВТ.Организация ИЗ ВТ КАК ВТ)
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация, 
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	Т.ИндексСтроки КАК ИндексСтроки, 
		|	Т.Организация КАК Организация,
		|	Т.Дата КАК Дата,
		|	Т.Код КАК Код,
		|	Т.Период КАК Период,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА Т.Код = ""Руководитель""
		|			ТОГДА ЕСТЬNULL(Рег1.Руководитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""ВыбранныйПодписант""
		|			ТОГДА ЕСТЬNULL(Рег1.Руководитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""ГлавныйБухгалтер""
		|			ТОГДА ЕСТЬNULL(Рег1.ГлавныйБухгалтер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""Кассир""
		|			ТОГДА ЕСТЬNULL(Рег1.Кассир, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""РуководительКадровойСлужбы""
		|			ТОГДА ЕСТЬNULL(Рег1.РуководительКадровойСлужбы, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""ОтветственныйЗаВУР""
		|			ТОГДА ЕСТЬNULL(Рег1.ОтветственныйЗаВУР, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""ОтветственныйЗаОхрануТруда""
		|			ТОГДА ЕСТЬNULL(Рег1.ОтветственныйЗаОхрануТруда, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		КОГДА Т.Код = ""ПредставительСФР""
		|			ТОГДА ЕСТЬNULL(Рег1.ПредставительСФР, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|	КОНЕЦ) КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ2
		|ИЗ 
		|	(ВЫБРАТЬ    
		|		ВТ.ИндексСтроки КАК ИндексСтроки, 
		|		ВТ.Организация,
		|		ВТ.Дата,
		|		ВТ_Коды.Код,
		|		МАКСИМУМ(ЕСТЬNULL(Рег1.Период, ДАТАВРЕМЯ(1,1,1))) КАК Период
		|	ИЗ ВТ КАК ВТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Коды КАК ВТ_Коды
		|	ПО ИСТИНА
		|	ЛЕВОЕ СОЕДИНЕНИЕ Рег1 КАК Рег1
		|	ПО ВТ.Организация = Рег1.Организация
		|		И ВТ.Дата >= Рег1.Период
		|		И ВЫБОР
		|			КОГДА ВТ_Коды.Код = ""Руководитель""
		|				ТОГДА Рег1.Руководитель <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""ВыбранныйПодписант""
		|				ТОГДА Рег1.Руководитель <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""ГлавныйБухгалтер""
		|				ТОГДА Рег1.ГлавныйБухгалтер <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""Кассир""
		|				ТОГДА Рег1.Кассир <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""РуководительКадровойСлужбы""
		|				ТОГДА Рег1.РуководительКадровойСлужбы <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""ОтветственныйЗаВУР""
		|				ТОГДА Рег1.ОтветственныйЗаВУР <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""ОтветственныйЗаОхрануТруда""
		|				ТОГДА Рег1.ОтветственныйЗаОхрануТруда <> &ФизическиеЛица_ПустаяСсылка
		|			КОГДА ВТ_Коды.Код = ""ПредставительСФР""
		|				ТОГДА Рег1.ПредставительСФР <> &ФизическиеЛица_ПустаяСсылка
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО 
		|		ВТ.ИндексСтроки,
		|		ВТ.Организация,
		|		ВТ.Дата,
		|		ВТ_Коды.Код) КАК Т
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Рег1 КАК Рег1
		|ПО
		|	Т.Организация = Рег1.Организация
		|	И Т.Период = Рег1.Период
		|	И ВЫБОР
		|		КОГДА Т.Код = ""Руководитель""
		|			ТОГДА Рег1.Руководитель <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""ВыбранныйПодписант""
		|			ТОГДА Рег1.Руководитель <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""ГлавныйБухгалтер""
		|			ТОГДА Рег1.ГлавныйБухгалтер <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""Кассир""
		|			ТОГДА Рег1.Кассир <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""РуководительКадровойСлужбы""
		|			ТОГДА Рег1.РуководительКадровойСлужбы <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""ОтветственныйЗаВУР""
		|			ТОГДА Рег1.ОтветственныйЗаВУР <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""ОтветственныйЗаОхрануТруда""
		|			ТОГДА Рег1.ОтветственныйЗаОхрануТруда <> &ФизическиеЛица_ПустаяСсылка
		|		КОГДА Т.Код = ""ПредставительСФР""
		|			ТОГДА Рег1.ПредставительСФР <> &ФизическиеЛица_ПустаяСсылка
		|	КОНЕЦ
		|СГРУППИРОВАТЬ ПО
		|	Т.ИндексСтроки,
		|	Т.Организация,
		|	Т.Дата,
		|	Т.Код,
		|	Т.Период	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ВТ2.ИндексСтроки КАК ИндексСтроки,
		|	ВТ2.Организация КАК Организация,
		|	ВТ2.Код КАК Код,
		|	ВТ2.Дата КАК Дата,
		|	ВТ2.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ2.Код КАК НаименованиеТипа,
		|	ОснованияПолномочийОтветственныхЛиц.ОснованиеПодписи КАК ОснованиеПодписи,
		|	ОснованияПолномочийОтветственныхЛиц.Должность КАК Должность,
		|	ОснованияПолномочийОтветственныхЛиц.ДатаНачала КАК ДатаНачала,
		|	ОснованияПолномочийОтветственныхЛиц.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТ2 КАК ВТ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияПолномочийОтветственныхЛиц КАК ОснованияПолномочийОтветственныхЛиц
		|		ПО (ВТ2.Организация = ОснованияПолномочийОтветственныхЛиц.Организация)
		|			И (ВТ2.ФизическоеЛицо = ОснованияПолномочийОтветственныхЛиц.ФизическоеЛицо)";    
		
		Таблица = Запрос.Выполнить().Выгрузить();
		
		ТаблицаДанных.Индексы.Очистить();
		ТаблицаДанных.Индексы.Добавить("ИндексСтроки");
		Если НЕ ПроверитьВКеше Тогда
			КешДанных = Таблица;
		КонецЕсли;
		
		Если ПроверитьВКеше Тогда
			КешДанных.Индексы.Очистить();
			КешДанных.Индексы.Добавить("Организация, Код, Дата");
		КонецЕсли;
			
		// Таблица получена по текущей ТаблицаДанных, так что можем искать строки по ИндексСтроки
		Для каждого Строка Из Таблица Цикл
			Если Строка.Код = Код Тогда
				ИндексСтроки = Строка.ИндексСтроки;
				ИсходнаяСтрока = ТаблицаДанных.Найти(ИндексСтроки, "ИндексСтроки");
				Если НЕ ИсходнаяСтрока = Неопределено Тогда
					ИсходнаяСтрока[КолонкаРезультат] = Строка[КолонкаЗапроса];	
				КонецЕсли;
			КонецЕсли;
			Если ПроверитьВКеше Тогда
				ПоискВКеше = Новый Структура("Организация, Код, Дата");
				ЗаполнитьЗначенияСвойств(ПоискВКеше, Строка);
				НайдСтрокиКеша = КешДанных.НайтиСтроки(ПоискВКеше);
				Если НайдСтрокиКеша.Количество() = 0 Тогда
					СтрокаКеша = КешДанных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаКеша, Строка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		ТаблицаДанных.Индексы.Очистить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗУП_КадровыеДанные

Процедура ПолучитьКадровыеДанныеСотрудника(ТаблицаДанных, ИдентификаторАлгоритма, КолонкаРезультат, КолонкаИсточник, ДополнительныеВыраженияАлгоритма, Контекст, КешДанных, ТекстОшибки = "") Экспорт 
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	МодульКадровыйУчет = ОбщегоНазначения.ОбщийМодуль("КадровыйУчет");
	
	//КадровыйУчет.КадровыеДанныеФизическихЛиц(   //КадровыйУчет.КадровыеДанныеСотрудников(
	ПараметрыАлгоритма = СтрРазделить(ИдентификаторАлгоритма, "|");
	Код = ПараметрыАлгоритма[0];
	КолонкаЗапроса = ПараметрыАлгоритма[1]; 
	
	ТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	ИмяКолонкиДата = Неопределено;
	Если ДополнительныеВыраженияАлгоритма.Количество() > 0 Тогда
		СтруктураВыражениеКолонка = ДополнительныеВыраженияАлгоритма[0];
		ИмяКолонкиДата = СтруктураВыражениеКолонка.ИмяКолонки;
	КонецЕсли;
	
	ЗапросыПоДате = Новый Соответствие;
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаИсточник]) Тогда
			Продолжить;
		КонецЕсли;
		Поиск = Новый Структура;
		Поиск.Вставить("СотрудникФизлицо", СтрокаТаблицы[КолонкаИсточник]);
		//Поиск.Вставить("Код", Код);
		Если ИмяКолонкиДата = Неопределено Тогда
			Поиск.Вставить("Дата", ТекущаяДатаСеанса);
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонкиДата]) Тогда
				Поиск.Вставить("Дата", ТекущаяДатаСеанса);                    
			Иначе
				Поиск.Вставить("Дата", СтрокаТаблицы[ИмяКолонкиДата]);
			КонецЕсли;
		КонецЕсли;
		Если ЗапросыПоДате.Получить(Поиск.Дата) = Неопределено Тогда
			ЗапросыПоДате.Вставить(Поиск.Дата, Новый Структура("Сотрудники, Физлица, ИндексыСтрок", Новый Массив, Новый Массив, Новый Массив)); 	
		КонецЕсли;
		СтруктураСотрудникиФизлица = ЗапросыПоДате.Получить(Поиск.Дата);
		Если ТипЗнч(Поиск.СотрудникФизлицо) = Тип("СправочникСсылка.Сотрудники") Тогда
			Если СтруктураСотрудникиФизлица.Сотрудники.Найти(Поиск.СотрудникФизлицо) = Неопределено Тогда
				СтруктураСотрудникиФизлица.Сотрудники.Добавить(Поиск.СотрудникФизлицо);
			КонецЕсли;
		//ИначеЕсли ТипЗнч(Поиск.СотрудникФизлицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		//	Если СтруктураСотрудникиФизлица.Физлица.Найти(Поиск.СотрудникФизлицо) = Неопределено Тогда
		//		СтруктураСотрудникиФизлица.Физлица.Добавить(Поиск.СотрудникФизлицо);
		//	КонецЕсли;
		КонецЕсли;
		Если СтруктураСотрудникиФизлица.ИндексыСтрок.Найти(СтрокаТаблицы.ИндексСтроки) = Неопределено Тогда
			СтруктураСотрудникиФизлица.ИндексыСтрок.Добавить(СтрокаТаблицы.ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанных.Индексы.Очистить();
	ТаблицаДанных.Индексы.Добавить("ИндексСтроки");
	Если ЗапросыПоДате.Количество() > 0 Тогда
		Для каждого КлючИЗначение Из ЗапросыПоДате Цикл
			Дата = КлючИЗначение.Ключ;	
			СтруктураСотрудникиФизлица = КлючИЗначение.Значение;		
			Если СтруктураСотрудникиФизлица.Сотрудники.Количество() > 0 Тогда
				Результат = МодульКадровыйУчет.КадровыеДанныеСотрудников(Истина, СтруктураСотрудникиФизлица.Сотрудники,КолонкаЗапроса, Дата);
			//ИначеЕсли СтруктураСотрудникиФизлица.Физлица.Количество() > 0 Тогда
				//Результат = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СтруктураСотрудникиФизлица.Сотрудники,КолонкаЗапроса, Дата);
			КонецЕсли;
			ИндексыСтрок = СтруктураСотрудникиФизлица.ИндексыСтрок;
			Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
				Для каждого ИндексСтроки Из ИндексыСтрок Цикл
					НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ИндексСтроки", ИндексСтроки));
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
						ЗначениеПоиска = НайденнаяСтрока[КолонкаИсточник];
						Если ИмяКолонкиДата = Неопределено Тогда
							Дата = ТекущаяДатаСеанса;
						Иначе	
							Дата = НайденнаяСтрока[ИмяКолонкиДата];
						КонецЕсли;
						СтрокиРезультата = Результат.НайтиСтроки(Новый Структура("Сотрудник, Период", ЗначениеПоиска, Дата));
						Если СтрокиРезультата.Количество() > 0 Тогда
							Попытка
							    // В оригинале получение значений было через попытку. Например, для
								// получения Регистратора колонки не совпадают. Нужно делать или 
								// доуточнения через Если Тогда, либо получение данных через попытку.
								НайденнаяСтрока[КолонкаРезультат] = СтрокиРезультата[0][КолонкаЗапроса];
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				
			
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;	                                               
		
		
	КонецЕсли;
	ТаблицаДанных.Индексы.Очистить();

		
КонецПроцедуры 

Процедура ПолучитьКадровыеДанныеФизлица(ТаблицаДанных, ИдентификаторАлгоритма, КолонкаРезультат, КолонкаИсточник, ДополнительныеВыраженияАлгоритма, Контекст, КешДанных, ТекстОшибки = "") Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	МодульКадровыйУчет = ОбщегоНазначения.ОбщийМодуль("КадровыйУчет");
	
	//КадровыйУчет.КадровыеДанныеФизическихЛиц(   //КадровыйУчет.КадровыеДанныеСотрудников(
	ПараметрыАлгоритма = СтрРазделить(ИдентификаторАлгоритма, "|");
	Код = ПараметрыАлгоритма[0];
	КолонкаЗапроса = ПараметрыАлгоритма[1]; 
	
	ТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	ИмяКолонкиДата = Неопределено;
	Если ДополнительныеВыраженияАлгоритма.Количество() > 0 Тогда
		СтруктураВыражениеКолонка = ДополнительныеВыраженияАлгоритма[0];
		ИмяКолонкиДата = СтруктураВыражениеКолонка.ИмяКолонки;
	КонецЕсли;
	
	ЗапросыПоДате = Новый Соответствие;
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[КолонкаИсточник]) Тогда
			Продолжить;
		КонецЕсли;
		Поиск = Новый Структура;
		Поиск.Вставить("СотрудникФизлицо", СтрокаТаблицы[КолонкаИсточник]);
		//Поиск.Вставить("Код", Код);
		Если ИмяКолонкиДата = Неопределено Тогда
			Поиск.Вставить("Дата", ТекущаяДатаСеанса);
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонкиДата]) Тогда
				Поиск.Вставить("Дата", ТекущаяДатаСеанса);                    
			Иначе
				Поиск.Вставить("Дата", СтрокаТаблицы[ИмяКолонкиДата]);
			КонецЕсли;
		КонецЕсли;         
		Если ЗапросыПоДате.Получить(Поиск.Дата) = Неопределено Тогда
			ЗапросыПоДате.Вставить(Поиск.Дата, Новый Структура("Сотрудники, Физлица, ИндексыСтрок", Новый Массив, Новый Массив, Новый Массив)); 	
		КонецЕсли;
		СтруктураСотрудникиФизлица = ЗапросыПоДате.Получить(Поиск.Дата);
		Если ТипЗнч(Поиск.СотрудникФизлицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если СтруктураСотрудникиФизлица.Физлица.Найти(Поиск.СотрудникФизлицо) = Неопределено Тогда
				СтруктураСотрудникиФизлица.Физлица.Добавить(Поиск.СотрудникФизлицо);
			КонецЕсли;
		//ИначеЕсли ТипЗнч(Поиск.СотрудникФизлицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		//	Если СтруктураСотрудникиФизлица.Физлица.Найти(Поиск.СотрудникФизлицо) = Неопределено Тогда
		//		СтруктураСотрудникиФизлица.Физлица.Добавить(Поиск.СотрудникФизлицо);
		//	КонецЕсли;
		КонецЕсли;
		Если СтруктураСотрудникиФизлица.ИндексыСтрок.Найти(СтрокаТаблицы.ИндексСтроки) = Неопределено Тогда
			СтруктураСотрудникиФизлица.ИндексыСтрок.Добавить(СтрокаТаблицы.ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанных.Индексы.Очистить();
	ТаблицаДанных.Индексы.Добавить("ИндексСтроки");
	Если ЗапросыПоДате.Количество() > 0 Тогда
		Для каждого КлючИЗначение Из ЗапросыПоДате Цикл
			Дата = КлючИЗначение.Ключ;	
			СтруктураСотрудникиФизлица = КлючИЗначение.Значение;		
			//Если СтруктураСотрудникиФизлица.Сотрудники.Количество() > 0 Тогда
			//	Результат = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СтруктураСотрудникиФизлица.Сотрудники,КолонкаЗапроса, Дата);
			Если СтруктураСотрудникиФизлица.Физлица.Количество() > 0 Тогда
				Результат = МодульКадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СтруктураСотрудникиФизлица.Физлица,КолонкаЗапроса, Дата);
			КонецЕсли;
			ИндексыСтрок = СтруктураСотрудникиФизлица.ИндексыСтрок;
			Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
				Для каждого ИндексСтроки Из ИндексыСтрок Цикл
					НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ИндексСтроки", ИндексСтроки));
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
						ЗначениеПоиска = НайденнаяСтрока[КолонкаИсточник];
						Если ИмяКолонкиДата = Неопределено Тогда
							Дата = ТекущаяДатаСеанса;
						Иначе	
							Дата = НайденнаяСтрока[ИмяКолонкиДата];
						КонецЕсли;
						СтрокиРезультата = Результат.НайтиСтроки(Новый Структура("ФизическоеЛицо, Период", ЗначениеПоиска, Дата));
						Если СтрокиРезультата.Количество() > 0 тогда
							// В исходном коде получение через попытку-исключение.
							// например, для регистратора нет точного соответствия с колонкой - результатом
							// Нужно или точечно проверять и дорабатывать через условия или нет результата
							Попытка
								НайденнаяСтрока[КолонкаРезультат] = СтрокиРезультата[0][КолонкаЗапроса];
							Исключение
								//
							КонецПопытки;
							
						КонецЕсли;
					КонецЦикла;
				
			
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;	                                               
		
		
	КонецЕсли;
	ТаблицаДанных.Индексы.Очистить();

		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли