
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
	ТекущееВыражение = Параметры.ТекущееВыражение;
	ТипЗначения = Параметры.ТипЗначения;
	ОтборПоТипуЗначения = Параметры.ОтборПоТипуЗначения;
	ОграниченияРазвертки = Параметры.ОграниченияРазвертки;
		
	МаксимальныйУровеньРазверткиСтрок = 0;
	tsc_РаботаСФормулами.ЗаполнитьДоступныеПоляПоСхемеКомпоновкиДанных(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыбор(Элементы.ДеревоВыбора.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоВыбораПриАктивизацииСтроки(Элемент)
	
	ДоступностьКоманды = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоВыбора.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущееВыражение = ТекущиеДанные.ПолныйИдентификаторСтроки;
		// Поле ссылочного типа и не превышает максимальный уровень развертки.
		ДоступностьКоманды = (ТекущиеДанные.РазворачиватьДоРеквизитов);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораПередРазворачиванием(Элемент, Строка, Отказ)
	
	ТекущиеДанные = ДеревоВыбора.НайтиПоИдентификатору(Строка);
	Если ТекущиеДанные.РазворачиватьДоРеквизитов
		И НЕ ТекущиеДанные.ПодчиненныеСтрокиРазворачивались Тогда
		// Если есть подчиненные реквизиты и для них не были получены реквизиты следующего уровня.
		РазвернутьПодчиненныеСтрокиДереваОперандов(Строка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазвернутьПодчиненныеСтрокиДереваОперандов(ИдентификаторТекущейСтрокиДереваОперандов)
	
	tsc_РаботаСФормулами.РазвернутьСтрокуОперандаДереваФормы(ДеревоВыбора,
		ИдентификаторТекущейСтрокиДереваОперандов,
		МаксимальныйУровеньРазверткиСтрок,
		ОграниченияРазвертки);
	
	// Обработка ограничений по типу значения или идентификатору доп.реквизита на форме.
	ТекущиеДанные = ДеревоВыбора.НайтиПоИдентификатору(ИдентификаторТекущейСтрокиДереваОперандов);
	Для Каждого ДобавленнаяСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		Если ДобавленнаяСтрока.РазрешаетсяВыборОперанда Тогда
			ДобавленнаяСтрока.РазрешаетсяВыборОперанда = tsc_РаботаСФормулами.ПодходящееПолеВыбора(ДобавленнаяСтрока,
				ТипЗначения,
				ОтборПоТипуЗначения);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбор(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УдалитьНедопустимыеСимволы(Строка) Экспорт
	НедопустимыеСимволы = """'`/\[]{}:;|-=?*<>,.()+#№@!%^&~";
	Строка = СтрСоединить(СтрРазделить(Строка, НедопустимыеСимволы, Истина));
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДеревоВыбора.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Не СтрокаДерева.РазрешаетсяВыборОперанда Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаДерева.ПолныйИдентификаторСтроки);
	
КонецПроцедуры





#КонецОбласти