#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ОпределениеСвойствДополнительныхХарактеристик

// Возвращает описание поддерживаемых источников характеристик.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица, описание поддерживаемых источников характеристик:
//    * МетаданныеИсточника - ОбъектМетаданных - Метаданные источника характеристик.
//    * ПрефиксТипаВидаХарактеристик - Строка - Идентификатор источника характеристик.
//    * ПолеИдентификатора - Строка -  Имя поля (реквизита) идентификатора (или наименования) вида характеристик.
//                           Например, "ИдентификаторДляФормул" для плана видов характеристик ДополнительныеРеквизитыИСведения.
//    * ПолеТипаЗначений   - Строка - Имя поля (реквизита), содержащее тип значения вида характеристик.
//    		Если указано выражение типа, то указание поля типа значения является не обязательным.
//    * ИспользуетсяВыражениеТипаЗначений - Булево - Флаг использования выражения типа значений, тогда вместо обращения
//    		к полю будет указано выражение.
//    		Например, для справочника ВидыКонтактнойИнформации.
//    * ВыражениеТипаЗначений - Строка - Выражение типа значений. Используется при отсутствии поля типа значений.
//    		Например, для справочника ВидыКонтактнойИнформации можно использовать
//    		выражение "ТИП(СТРОКА)".
//    * ПереопределениеВыраженияТипаЗначений - ОписаниеТипов - Содержит описание типов. Необходимо задавать всегда, когда нет реального поля,
//    		содержащего тип значения (не ПВХ, ИспользуетсяВыражениеТипаЗначений = Истина).
//    		Переопределение в методе НоваяСтрокаДереваПоПолюКомпоновки.
//    * УникальностьИмениВПределахВсейТаблицыХарактеристик - Булево - Если Истина, то идентификатор характеристики (поле имени) уникален
//    		во всей таблице характеристик. Например, значение поля "Имя" дополнительных реквизитов
//    		и сведений уникально во всей таблице ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения
//    		(т.к. один и тот же реквизит может входить в состав разных наборов).
//    		Если Ложь, то уникальность идентификатора характеристики (поле имени) не обеспечивается.
//    		Например, видов для контактной информации идентификатор "Телефон" будет использоваться
//    		в наборах "Контрагент" / "Организация" / "ФизическоеЛицо" и т.д.
//    		Если вид контактной информации указывается для одного типа, то мы можем точно определить
//    		параметры вида контактной информации (представление, тип). Если вид контактной информации
//    		указывается для составного типа, то параметры вида контактной информации (представление, тип)
//    		определяются так же как для обычных реквизитов (Представление берется с наименьшим значением,
//    		тип контактной информации указывается "прочее").
//
Функция СвойстваПоддерживаемыхИсточниковХарактеристик() Экспорт
	
	ОписаниеСтроки = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	ТаблицаСвойств = Новый ТаблицаЗначений();
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	ТаблицаСвойств.Колонки.Добавить("МетаданныеИсточника");
	ТаблицаСвойств.Колонки.Добавить("ПрефиксТипаВидаХарактеристик", ОписаниеСтроки);
	ТаблицаСвойств.Колонки.Добавить("ПолеИдентификатора", ОписаниеСтроки);
	ТаблицаСвойств.Колонки.Добавить("ПолеТипаЗначений", ОписаниеСтроки);
	ТаблицаСвойств.Колонки.Добавить("ИспользуетсяВыражениеТипаЗначений", ОписаниеБулево);
	ТаблицаСвойств.Колонки.Добавить("ВыражениеТипаЗначений", ОписаниеСтроки);
	ТаблицаСвойств.Колонки.Добавить("ПереопределениеВыраженияТипаЗначений");
	ТаблицаСвойств.Колонки.Добавить("УникальностьИмениВПределахВсейТаблицыХарактеристик", ОписаниеБулево);
	
	Свойства = ТаблицаСвойств.Добавить();
	Свойства.МетаданныеИсточника = Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения;
	Свойства.ПрефиксТипаВидаХарактеристик = "ДР.";
	Свойства.ПолеИдентификатора = "ИдентификаторДляФормул";
	Свойства.ПолеТипаЗначений = "ТипЗначения";
	Свойства.ИспользуетсяВыражениеТипаЗначений = Ложь;
	Свойства.ВыражениеТипаЗначений = "";
	Свойства.УникальностьИмениВПределахВсейТаблицыХарактеристик = Истина;
	
	Свойства = ТаблицаСвойств.Добавить();
	Свойства.МетаданныеИсточника = Метаданные.Справочники.ВидыКонтактнойИнформации;
	Свойства.ПрефиксТипаВидаХарактеристик = "КИ.";
	Свойства.ПолеИдентификатора = "ИдентификаторДляФормул";
	Свойства.ПолеТипаЗначений = "";
	Свойства.ИспользуетсяВыражениеТипаЗначений = Истина;
	Свойства.ВыражениеТипаЗначений = "ТИП(СТРОКА)";
	Свойства.ПереопределениеВыраженияТипаЗначений = Новый ОписаниеТипов("Строка");
	Свойства.УникальностьИмениВПределахВсейТаблицыХарактеристик = Ложь;
	
	tsc_РаботаСФормуламиПереопределяемый.ДополнитьТаблицуПоддерживаемыхСвойств(ТаблицаСвойств);
	
	ТаблицаСвойств.Индексы.Добавить("МетаданныеИсточника");
	ТаблицаСвойств.Индексы.Добавить("ПрефиксТипаВидаХарактеристик");
	
	Возврат ТаблицаСвойств;
	
КонецФункции

// Возвращаем массив префиксов характеристик для целей парсинга (отдельно от массива префиксов Алгоритмов)
Функция МассивПрефиковХарактеристик() Экспорт
	ТаблицаСвойств = СвойстваПоддерживаемыхИсточниковХарактеристик();
	
	Результат = Новый Массив;
	Для каждого Строка Из ТаблицаСвойств Цикл
		Результат.Добавить(Строка.ПрефиксТипаВидаХарактеристик);	
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Возвращаем массив префиксов таблиц.
// Для чего нам заключать табличные части в {ТЧ.ИмяТЧ} - как характеристики?
// Ведь казалось бы с точки вычисления выражений в СКД это бессмыслнно, т.к. 
// для вычисления в СКД мы все равно заменим "{ТЧ.ИмяТЧ}.РеквизитТЧ" на "ИмяТЧ.РеквизитТЧ"?
// Это нужно для 2 вещей:
// 1) в результате вычислений мы должны получать 1 и более результатирующих таблиц. Например,
//   выражения "ИсхДокумент.Реквизит1", "ИсходныйДокумент.Реквизит2.{ДР.ДопРеквизит1}" - это 1 таблица,
//   выражения "ИсхДокумент.{ТЧ.Товары}.Номенклатура", "ИсхДокумент.{ТЧ.Товары}.Номенклатура.Артикул", "ИсхДокумент.{ТЧ.Товары}.Количество" - это 2ая таблица,
//   выражения "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.ВидЦены" и "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.Цена" - это 3ая таблица.
// Нам нужно записывать таблицы с префиксами, чтобы перед выполнением не осуществлять обратный парсинг, чтобы понять, что перед нами таблица.
// 2) В каждую таблицу должна быть включена колонка - выражение НомерСтроки, чтобы сохранялся контекст.
//   Например, мы получим таблицу цен "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.Ссылка", "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.ВидЦены", "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.Цена",
//   но также и колонки "ИсхДокумент.{ТЧ.Товары}.НомерСтроки" и "ИсхДокумент.{ТЧ.Товары}.Номенклатура.{ТЧ.Цены}.НомерСтроки".
Функция МассивПрефиксовТаблиц() Экспорт
	Результат = Новый Массив;

	Результат.Добавить(tsc_РаботаСФормуламиКлиентСервер.ПрефиксТаблицыДляТабличныхЧастей());
	
	// по идее, произвольные алгоритмы также могут поддерживать вывод таблицы,
	// но типизацию колонок таблицы и НомерСтроки нужно проверять после получения данных
	// от произвольного метода алгоритма. 
	
	// Если алгоритм поддерживает получение таблицы от реквизита, то добавляем префикс алгоритма сюда,
	// НЕ НОВЫЙ префикс. Тогда перед выполнением мы будем понимать, что обращение к алгоритму = обращение к табличной части
	// ==> нужно выделять результат обращения в новую таблицу.
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОпределениеДополнительныхАлгоритмов

// Возвращает описание поддерживаемых алгоритмов.
//  Свойства могут зависеть от данных (например, от заполненности регистра сведений или справочника) и меняться в ходе сеанса.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица, описание поддерживаемых алгоритмов:
//
Функция СвойстваПоддерживаемыхАлгоритмов() Экспорт
	
	ОписаниеСтроки0 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	ОписаниеСтроки10 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная));
	ОписаниеСтроки150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	
	Свойства = Новый ТаблицаЗначений;
	
	// Заканчивается точкой, так же как и в характеристиках. Не должны совпадать с префиксами характеристик.
	Свойства.Колонки.Добавить("ПрефиксТипаВидаАлгоритма", ОписаниеСтроки10); 
	
	// Один и тот же алгоритм может использоваться для разных типов данных
	Свойства.Колонки.Добавить("МассивТиповИсточников", ); // Массив       
	
	// В идентификатор можно включить некоторое количество колонок, указав путь к ним через $.
	// Например, идентификатор с префиксом может и колонками может выглядеть так:
	// Док1.Номенклатура."{Алг1.ПериодичРасчетМаржиПоТовару$Док.Дата$Док.ВидЦен}",
	//  тогда "Алг1." - префикс, "ПериодичРасчетМаржиПоТовару$Док.Дата$.ВидЦен" - полный идентификатор,
	//  "$Док.Дата" и "$.ВидЦен"  - указание нужных для работы алгоритма колонок в составе идентификатора
	// Однако, если разворачиваются операнды "Док1" и "Док2", то очевидно, что нужно указать разные пути к колонкам.
	// Тоесть будут {Алг1.ПериодичРасчетМаржиПоТовару$Док1.Дата$Док1.ВидЦен} и {Алг1.ПериодичРасчетМаржиПоТовару$Док2.Дата$Док2.ВидЦен}
	// В таком случае следует воспользоваться указанием функции "ФункцияУказанияДопКолонокПриРазвертке" - которую необходимо размещать
	//  в общем модуле tsc_РаботаСФормуламиПереопределяемый 
	// В качестве пути к доп колонкам через $ могут быть указаны только те пути, что могут быть рассчитаны СКД (не должны включать алгоритмы)
	Свойства.Колонки.Добавить("Идентификатор", ОписаниеСтроки150);
	Свойства.Колонки.Добавить("Представление", ОписаниеСтроки150);
	
	// Алгоритмы могут распологаться в иерархических группах, в таком случае
	//  для групп заполняется флаг группы, идентификатор, описание, ПрефиксТипаВидаХарактеристик и МассивТиповИсточников
	// Группы в формулу выводиться не будут. Они нужны только для группировки алгоритмов в дереве операндов.
    Свойства.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	// Если родителя нет, то это корневой элемент / папка
	Свойства.Колонки.Добавить("Родитель", ОписаниеСтроки150);
	
	// Путь к функции для вычисления. Параметры функции: ВходящееЗначение, Контекст
	//    где: ВходящееЗначение - любое значение, расчитанное до вызова алгоритма, например,
	//        [ПриемНаРаботу.Организация.{ДР.ОсновноеПодразделениеПродаж}.{Отв.ОсновнойПодписантДляПодразделения}]
	//			тут ВходящееЗначение = результат вычисления выражения "ПриемНаРаботу.Организация.{ДР.ОсновноеПодразделениеПродаж}" = "Подразделение оптовых продаж"
	//         Контекст - Структура, со свойствами
	//            - Объект: - в данном случае ссылка на док.ПриемНаРаботу
	//            - ИмяТабличнойЧасти - заполнено только если сразу после объекта идет обращение к таблиной части
	//            - НомерСтрокиТЧ  - заполнено только если сразу после объекта идет обращение к таблиной части
	Свойства.Колонки.Добавить("ФункцияДляВычисления", ОписаниеСтроки0);
	
	// Выполняется при разверке родительского операнда и выводе операнда алгоритма на форму.
	// Служит для доопределения состава дополнительных колонок, нужных алгоритму, и указывающихся через $
	Свойства.Колонки.Добавить("ФункцияУказанияДопКолонокПриРазвертке", ОписаниеСтроки0);
	
	// Если заполнить, то возможна дальнейшая развертка. например, основной подписант - физ лицо, у которого есть контактная информация.
	Свойства.Колонки.Добавить("ОписаниеТиповРезультатаВычисления", );
	
	
	 
	       
	tsc_РаботаСФормуламиПереопределяемый.ДополнитьТаблицуПоддерживаемыхСвойствАлгоритмов(Свойства);

	Свойства.Индексы.Добавить("ПрефиксТипаВидаАлгоритма, Идентификатор, ЭтоГруппа");
	Возврат Свойства;
КонецФункции

Функция ДеревоАлгоритмовПоТипуИсточника() Экспорт
	ТаблицаСвойств = СвойстваПоддерживаемыхАлгоритмов();
	ТаблицаСвойств.Индексы.Добавить("ПрефиксТипаВидаАлгоритма, Родитель");
	
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Тип");
	Результат.Колонки.Добавить("ПрефиксТипаВидаАлгоритма", ТаблицаСвойств.Колонки["ПрефиксТипаВидаАлгоритма"].ТипЗначения);
	Результат.Колонки.Добавить("ДеревоАлгоритмов");
	
	Свойства = Новый ТаблицаЗначений;
	
	Префиксы = МассивПрефиковАлгоритмов();
	
	Для каждого Префикс Из Префиксы Цикл
		
		ДеревоАлгоритмов = Новый ДеревоЗначений;
		ДеревоАлгоритмов.Колонки.Добавить("ПрефиксТипаВидаАлгоритма", ТаблицаСвойств.Колонки["ПрефиксТипаВидаАлгоритма"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("МассивТиповИсточников");
		ДеревоАлгоритмов.Колонки.Добавить("Идентификатор", ТаблицаСвойств.Колонки["Идентификатор"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("Представление", ТаблицаСвойств.Колонки["Представление"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("ЭтоГруппа", ТаблицаСвойств.Колонки["ЭтоГруппа"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("Родитель", ТаблицаСвойств.Колонки["Родитель"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("ФункцияДляВычисления", ТаблицаСвойств.Колонки["ФункцияДляВычисления"].ТипЗначения);
		ДеревоАлгоритмов.Колонки.Добавить("ОписаниеТиповРезультатаВычисления");                                               
		ДеревоАлгоритмов.Колонки.Добавить("ФункцияУказанияДопКолонокПриРазвертке", ТаблицаСвойств.Колонки["ФункцияУказанияДопКолонокПриРазвертке"].ТипЗначения);
		
		ЗаполнитьДеревоАлгоритмовРекурсивно(ТаблицаСвойств, ДеревоАлгоритмов, Префикс, "");
		Если ДеревоАлгоритмов.Строки.Количество() <> 0 Тогда
			МассивТипов = ДеревоАлгоритмов.Строки[0].МассивТиповИсточников;
			Для каждого Тип Из МассивТипов Цикл
				СтрокаРезультат = Результат.Добавить();
				СтрокаРезультат.Тип = Тип;
				СтрокаРезультат.ПрефиксТипаВидаАлгоритма = Префикс;
				СтрокаРезультат.ДеревоАлгоритмов = ДеревоАлгоритмов.Скопировать();	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Результат.Индексы.Добавить("Тип");
	Возврат Результат;
КонецФункции

// Возвращаем массив префиксов алгоритмов для целей парсинга (отдельно от массива префиксов Характеристик)
Функция МассивПрефиковАлгоритмов() Экспорт
	
	Результат = Новый Массив;
	
	ТаблицаСвойств = СвойстваПоддерживаемыхАлгоритмов();
	ТаблицаСвойств.Свернуть("ПрефиксТипаВидаАлгоритма", "");
	Результат = ТаблицаСвойств.ВыгрузитьКолонку("ПрефиксТипаВидаАлгоритма");
	
	Возврат Результат;
КонецФункции

#КонецОбласти

// Возвращает соответствие английских и русских имен стандартных реквизитов.
// 
// Возвращаемое значение:
// 	Соответствие - Соответствие английских и русских имен стандартных реквизитов.
//
Функция СоответствияИменСтандартныхРеквизитов() Экспорт
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("DeletionMark", "ПометкаУдаления");
	СоответствиеИмен.Вставить("Owner", "Владелец");
	СоответствиеИмен.Вставить("Code", "Код");
	СоответствиеИмен.Вставить("Parent", "Родитель");
	СоответствиеИмен.Вставить("Predefined", "Предопределенный");
	СоответствиеИмен.Вставить("IsFolder", "ЭтоГруппа");
	СоответствиеИмен.Вставить("Description", "Наименование");
	СоответствиеИмен.Вставить("Ref", "Ссылка");
	СоответствиеИмен.Вставить("PredefinedDataName", "ИмяПредопределенныхДанных");
	СоответствиеИмен.Вставить("Date", "Дата");
	СоответствиеИмен.Вставить("Number", "Номер");
	СоответствиеИмен.Вставить("Posted", "Проведен");
	СоответствиеИмен.Вставить("ValueType", "ТипЗначения");
	СоответствиеИмен.Вставить("Type", "Вид");
	СоответствиеИмен.Вставить("Order", "Порядок");
	СоответствиеИмен.Вставить("ActionPeriodIsBasic", "Забалансовый");
	СоответствиеИмен.Вставить("HeadTask", "ВедущаяЗадача");
	СоответствиеИмен.Вставить("Completed", "Завершен");
	СоответствиеИмен.Вставить("Started", "Стартован");
	СоответствиеИмен.Вставить("BusinessProcess", "БизнесПроцесс");
	СоответствиеИмен.Вставить("Executed", "Выполнена");
	СоответствиеИмен.Вставить("RoutePoint", "ТочкаМаршрута");
	СоответствиеИмен.Вставить("SentNo", "НомерОтправленного");
	СоответствиеИмен.Вставить("ReceivedNo", "НомерПринятого");
	СоответствиеИмен.Вставить("ThisNode", "ЭтотУзел");
	
	
	// Обратное соответствие.
	Для каждого КлючИЗначение Из СоответствиеИмен Цикл
		СоответствиеИмен.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат СоответствиеИмен;
	
КонецФункции

// Возвращает соответствие английских и русских имен стандартных реквизитов табличных частей.
// 
// Возвращаемое значение:
// 	Соответствие - Соответствие английских и русских имен стандартных реквизитов.
//
Функция СоответствияИменСтандартныхРеквизитовТабличныхЧастей() Экспорт
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("LineNumber", "НомерСтроки");
		
	
	// Обратное соответствие.
	Для каждого КлючИЗначение Из СоответствиеИмен Цикл
		СоответствиеИмен.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат СоответствиеИмен;
	
КонецФункции

Функция ПолноеИмяТаблицыДанных(ПолноеИмяОбъектаМетаданных) Экспорт
	Возврат tsc_РаботаСФормулами.ПолноеИмяТаблицыДанных(ПолноеИмяОбъектаМетаданных);
КонецФункции

Функция ОбщиеСвойстваОграниченийРазверткиИПараметровДобавленияСтрок() Экспорт
	Результат = "";
	
	ОбщиеСвойства = Новый Массив;
							
	ОбщиеСвойства.Добавить("РекурсивноРазворачиватьОперандыСхемыКомпоновки");
	ОбщиеСвойства.Добавить("ВыводитьТабличныеЧасти");
	ОбщиеСвойства.Добавить("ВыводитьАлгоритмы");
	ОбщиеСвойства.Добавить("РазворачиватьСтрокиАлгоритмов");
	ОбщиеСвойства.Добавить("НеВыводимыеРеквизиты");
	ОбщиеСвойства.Добавить("НеВыводимыеТабличныеЧасти");
	ОбщиеСвойства.Добавить("ПрефиксыВыводимыхАлгоритмов");
	ОбщиеСвойства.Добавить("ПрефиксыНеВыводимыхАлгоритмов");
	ОбщиеСвойства.Добавить("НеВыводитьРеквизитыИТабличныеЧастиНачинающиесяСУдалить");
	ОбщиеСвойства.Добавить("ВыводитьТЧТолькоНа1омУровне");
	ОбщиеСвойства.Добавить("РеквизитыИТабличныеЧастиВГруппах");
	//ОбщиеСвойства.Добавить("СтандартныеРеквизитыПередРеквизитами");
	
	Результат = СтрСоединить(ОбщиеСвойства, ",");
	Возврат Результат;
КонецФункции

#Область МетодыДляОбновленияИнформационнойБазы

// Описание
// 
// Возвращаемое значение:
// 	Соответствие - соответствие представления и мест назначения характеристик:
// 	 *Ключ - Строка - Представление характеристики.
// 	 *Значение - Соответствие - соответствие типа объекта метаданных, которому принадлежит характеристика и ее параметров:
// 	        **Ключ - Тип - тип объекта метаданных, которому принадлежит характеристика. Одна характеристика может
// 	        				может быть указана нескольким типам.
// 	        **Значение - Структура - Параметры характеристики:
// 	             ***Характеристика - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения, СправочникСсылка.ВидыКонтактнойИнформации - Ссылка на характеристику.
// 	             ***Идентификатор - Строка - Идентификатор характеристики вида {Префикс.Идентификатор}
// 	             ***ТипЗначения - ОписаниеТипов - Тип значения характеристики.
//
Функция ХарактеристикиПоПредставлениям() Экспорт
	
	ТипВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	Возврат tsc_РаботаСФормулами.ХарактеристикиПоПредставлениям(ТипВсеСсылки);
	
КонецФункции

#КонецОбласти      

#Область Служебные

Процедура ЗаполнитьДеревоАлгоритмовРекурсивно(ТаблицаСвойств, МестоДобавления, ТекПрефикс, Знач ТекРодитель)
	
	Поиск = Новый Структура("ПрефиксТипаВидаАлгоритма, Родитель", ТекПрефикс, ТекРодитель);
	НайденныеСтроки = ТаблицаСвойств.НайтиСтроки(Поиск);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокаДерева = МестоДобавления.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, НайденнаяСтрока);	
			Если НайденнаяСтрока.ЭтоГруппа Тогда
				ЗаполнитьДеревоАлгоритмовРекурсивно(ТаблицаСвойств, СтрокаДерева, ТекПрефикс, СтрокаДерева.Идентификатор);		
			КонецЕсли;	
		КонецЦикла;
		 
	КонецЕсли;
			
	
КонецПроцедуры

	
#КонецОбласти




#КонецОбласти

#КонецЕсли