
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДеревоМетаданных();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданных()
	ТипыМетаданных = ТипыМетаданных();
	Для каждого КлючИЗначение Из ТипыМетаданных Цикл
		ИмяМенеджера = КлючИЗначение.Ключ;
		Названия = СтрРазделить(КлючИЗначение.Значение, "/", Ложь);
		
		Стр1Ур = ДеревоМетаданных.ПолучитьЭлементы().Добавить();
		Стр1Ур.Идентификатор = ИмяМенеджера;
		Стр1Ур.Синоним = Названия[1];
		Стр1Ур.Уровень = 1;
		
		Для каждого ОбъектМД Из Метаданные[ИмяМенеджера] Цикл
			Стр2Ур = Стр1Ур.ПолучитьЭлементы().Добавить();
			Стр2Ур.Идентификатор = ОбъектМД.ПолноеИмя();
			Стр2Ур.Синоним = СтрШаблон("%1.%2", Названия[0], ОбъектМД.Синоним);
			Стр2Ур.Уровень = 2;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТипыМетаданных()
	ТипыМетаданных = Новый Структура;
	ТипыМетаданных.Вставить("Справочники", НСтр("ru = 'Справочник/Справочники'"));
	ТипыМетаданных.Вставить("Документы", НСтр("ru = 'Документ/Документы'"));
	ТипыМетаданных.Вставить("ПланыВидовХарактеристик", НСтр("ru = 'План видов характеристик/Планы видов характеристик'"));
	ТипыМетаданных.Вставить("ПланыСчетов", НСтр("ru = 'План счетов/Планы счетов'"));
	ТипыМетаданных.Вставить("ПланыВидовРасчета", НСтр("ru = 'План видов расчета/Планы видов расчета'"));
	ТипыМетаданных.Вставить("БизнесПроцессы", НСтр("ru = 'Бизнес-процесс/Бизнес-процессы'"));
	ТипыМетаданных.Вставить("Задачи", НСтр("ru = 'Задача/Задачи'"));
	
	Возврат ТипыМетаданных;
КонецФункции

&НаКлиенте
Процедура ДеревоМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборСтрокиМетаданных(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбраннаяСтрока = Элементы.ДеревоМетаданных.ТекущаяСтрока;
	ВыборСтрокиМетаданных(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтрокиМетаданных(ВыбраннаяСтрока)
	СтрокаДерева = Неопределено;
	Если НЕ ВыбраннаяСтрока = Неопределено Тогда
		СтрокаДерева = ДеревоМетаданных.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если НЕ СтрокаДерева.Уровень = 2 Тогда
			СтрокаДерева = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если СтрокаДерева = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Выберите объект метаданных'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "ДеревоМетаданных";
		Сообщение.Сообщить();
	Иначе
		СтрокаМетаданных = СтрокаДерева.Идентификатор;
		Закрыть(СтрокаМетаданных);
	КонецЕсли;
	
КонецПроцедуры
