#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ТекстОшибкиtsc_СправочникИдентификаторыОбъектовМетаданных() Экспорт 
	ТекстОшибки = НСтр("ru = 'Ошибка в расширении ""Конструктор формул: в определяемом типе ""tsc_СправочникИдентификаторыОбъектовМетаданных"" должен быть 1 тип данных!'");
	Возврат ТекстОшибки;
КонецФункции

Функция ТипЗначенияОпределяемогоТипа(МДОпределяемыйТип) Экспорт
	Типы = МДОпределяемыйТип.Тип.Типы();
	Если Типы.Количество() <> 1
		Или Типы[0] = Тип("Строка")
		Или Типы[0] = Тип("Число")
		Или Типы[0] = Тип("Дата")
		Или Типы[0] = Тип("Булево")
		Или Типы[0] = Тип("Неопределено") Тогда
		Если МДОпределяемыйТип = Метаданные.ОпределяемыеТипы.tsc_СправочникИдентификаторыОбъектовМетаданных Тогда
			ТекстОшибки = ТекстОшибкиtsc_СправочникИдентификаторыОбъектовМетаданных();
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка в расширении ""Конструктор формул: не предусмотренный тип параметра ""МДОпределяемыйТип""!'");
		КонецЕсли;
		Сообщить(ТекстОшибки);
		Тип = Неопределено;
	Иначе
		Тип = Типы[0];	
	КонецЕсли;
	
	Возврат Тип;	
КонецФункции

Функция ОбъектМДОпределяемогоТипа(МДОпределяемыйТип) Экспорт
	Тип = ТипЗначенияОпределяемогоТипа(МДОпределяемыйТип);
	ОбъектМД = Метаданные.НайтиПоТипу(Тип);
	Возврат ОбъектМД;
КонецФункции

// Функция - Объект МДПо идентификатору объекта метаданных
//
// Параметры:
//  ИдентификаторОбъектаМетаданных	 - СправочникСсылка.ИдентификаторыОбъектовМетаданных - 
// 
// Возвращаемое значение:
//   - Неопределено, ОбъектМетаданных
//
Функция ОбъектМДПоИдентификаторуОбъектаМетаданных(ИдентификаторОбъектаМетаданных) Экспорт
	МДСпрИдентификаторыОбъектовМетаданных = tsc_ОбщегоНазначения.ОбъектМДОпределяемогоТипа(Метаданные.ОпределяемыеТипы.tsc_СправочникИдентификаторыОбъектовМетаданных);
	МенеджерСправочника = Справочники[МДСпрИдентификаторыОбъектовМетаданных.Имя];
	ОбъектМетаданных = МенеджерСправочника.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъектаМетаданных, Истина);
	Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда 
		 ОбъектМетаданных = Неопределено;
	КонецЕсли;
	Возврат ОбъектМетаданных;
КонецФункции

#КонецЕсли