
#Область ПрограммныйИнтерфейс

#Область ПарсингФормулыИОперандов

// Вычисляет значение идентификатора из строки соответствии с правилами именования переменных.
// 
// Параметры:
//  СтрНаименование - Строка - Наименование, строка из которой необходимо получить идентификатор. 
//
// Возвращаемое значение:
//  Строка - Идентификатор, соответствующий правилам именования идентификаторов.
//
Функция ИдентификаторДляФормул(СтрНаименование, ЗаменятьСпецСимволыНижнимПодчеркиванием = Ложь) Экспорт
	
	Идентификатор = СтрНаименование;
	
	Цифры = Новый Массив();
	Для Сч = 0 По 9 Цикл
		Цифры.Добавить(Строка(Сч));
	КонецЦикла;
	
	ПервыйСимволНеЦифра = Ложь;
	
	Идентификатор = ПолучитьИдентификатор(Идентификатор, ЗаменятьСпецСимволыНижнимПодчеркиванием);
	
	Если Не ПустаяСтрока(Идентификатор) Тогда
		Пока НЕ ПервыйСимволНеЦифра Цикл
			Если Цифры.Найти(Сред(Идентификатор, 1, 1)) = Неопределено Тогда
				ПервыйСимволНеЦифра = Истина;
			КонецЕсли;
			Если ПервыйСимволНеЦифра Тогда
				Прервать;
			Иначе
				Идентификатор = Сред(Идентификатор, 2);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

Функция ПрефиксТаблицыДляТабличныхЧастей() Экспорт
	ПрефиксТЧ = "ТЧ.";
	Возврат ПрефиксТЧ;
КонецФункции

Функция ИмяТабличнойЧастиИзЧастиОперанда(ЧастьОперанда) Экспорт
	Поиск = "{" + ПрефиксТаблицыДляТабличныхЧастей();
	Если СтрНачинаетсяС(ЧастьОперанда, Поиск)  Тогда
		ИмяТЧ = СтрЗаменить(СтрЗаменить(ЧастьОперанда, Поиск, ""), "}", "");
	Иначе
		ИмяТЧ = "";
	КонецЕсли;
	Возврат ИмяТЧ;
КонецФункции

// Получает текст операнда для вставки в формулу.
//
// Параметры:
//  Операнд - Строка - имя операнда.
//
// Возвращаемое значение:
//  Строка - Текст операнда для вставки.
//
Функция ПолучитьТекстОперандаДляВставки(Операнд) Экспорт
	
	Возврат "[" + Операнд + "]";
	
КонецФункции // ПолучитьТекстОперандаДляВставки()

// Извлекает операнды из текстовой формулы
//
// Параметры:
//  Формула - Строка - текст формулы.
//  ТолькоУникальные - Булево - Если Истина, то в возвращаемый массив помещаются только уникальные операнды.
//
// Возвращаемое значение:
//  Массив - Операнды из текстовой формулы (без внешних скобок, например, "Номенклатура.{ДР.Экспедитор}").
//
Функция ОперандыТекстовойФормулы(Формула, ТолькоУникальные = Ложь) Экспорт
	
	МассивОперандов = Новый Массив;
	
	ТегНачалаОперанда = "[";
	ТегОкончанияОперанда = "]";
	
	ОставшаясяЧастьФормулы = Формула;
	
	НачалоОперанда = СтрНайти(ОставшаясяЧастьФормулы, ТегНачалаОперанда);
	Пока НачалоОперанда > 0 Цикл
		КонецОперанда = ПозицияЗакрывающегоТегаОкончанияОперанда(ОставшаясяЧастьФормулы, ТегНачалаОперанда, ТегОкончанияОперанда);
		Операнд = Сред(ОставшаясяЧастьФормулы, НачалоОперанда, (КонецОперанда - НачалоОперанда + 1));
		ОперандБезВнешнихСкобок = Сред(Операнд, 2, СтрДлина(Операнд) - 2);
		Если ТолькоУникальные Тогда
			Если МассивОперандов.Найти(ОперандБезВнешнихСкобок) = Неопределено Тогда
				МассивОперандов.Добавить(ОперандБезВнешнихСкобок);
			КонецЕсли;
		Иначе
			МассивОперандов.Добавить(ОперандБезВнешнихСкобок);
		КонецЕсли;
		
		ОставшаясяЧастьФормулы = Сред(ОставшаясяЧастьФормулы, КонецОперанда + 1);
		НачалоОперанда = СтрНайти(ОставшаясяЧастьФормулы, ТегНачалаОперанда);
	КонецЦикла;
	
	
	Возврат МассивОперандов;
	
КонецФункции

// Возвращает массив частей операнда. Например, операнд
// 			"СтрокаТабличнойЧасти[0].РеквизитТЧ.{ХарактеристикаРеквизита}.РеквизитХарактеристики"
// должен быть разделен на части:
// 			"СтрокаТабличнойЧасти[0]", "РеквизитТЧ", "{ХарактеристикаРеквизита}", "РеквизитХарактеристики".
// 
// Параметры:
// 	Операнд - Строка - Операнд формулы.
// 	ПредставленияХарактеристик - Булево - Флаг, указывающий, что парсится выражения с представлениями характеристик,
// 				а не идентификаторами.
// 	УдалятьВнешниеСкобки - Булево - Если Истина, то если операнд заключен во внешние [] скобки, они будут удалены.
// 				В основном, если операнд заключен во внешние квадратные скобки, это ограничение самого операнда,
// 				как, например, в формулах видов номенклатур. Однако, если разбирается на части часть операнда, то
// 				внешние квадратные скобки являются признаком характеристики, и их удалять не следует.
// 				Например, в методе "ВыполнениеПроверкиИПреобразованияВыражений", может распарсиваться путь
// 				типа "Счет.Субконто1.[Представление характеристики]". Тогда часть "Счет.Субконто1" - является
// 				первой частью выражения, а "[Представление характеристики]" - второй.
// Возвращаемое значение:
// 	Массив из Строка - Части операнда.
//
Функция ЧастиОперанда(Операнд, ПредставленияХарактеристик = Ложь, УдалятьВнешниеСкобки = Истина) Экспорт
	Результат = Новый Массив;
	
	РазбираемыйТекст = Операнд;
	
	ТегНачалаОперанда = "[";
	ТегОкончанияОперанда = "]";
	
	ТегНачалаХарактеристики = "{";
	ТегОкончанияХарактеристики = "}";
	Если ПредставленияХарактеристик Тогда
		ТегНачалаХарактеристики = "[";
		ТегОкончанияХарактеристики = "]";
	КонецЕсли;
	
	Если УдалятьВнешниеСкобки Тогда
		// Если операнд заключен во внешние скобки [], их нужно удалить.
		Если Лев(РазбираемыйТекст, 1) = ТегНачалаОперанда
			И Прав(РазбираемыйТекст, 1) = ТегОкончанияОперанда Тогда
			РазбираемыйТекст = Сред(РазбираемыйТекст, 2, СтрДлина(РазбираемыйТекст) - 2);
		КонецЕсли;
	КонецЕсли;
	
	// Внутри характеристики через точку указывается префикс типа характеристики.
	// Поэтому сначала ищутся теги характеристик, вне этих тегов части операнда разделяются точкой.
	РазделительЧастейОперанда = ".";
	
	НачалоПозицииХарактеристики = СтрНайти(РазбираемыйТекст, ТегНачалаХарактеристики);
	Пока НачалоПозицииХарактеристики > 0 Цикл
		КонецПозицииХарактеристики = ПозицияЗакрывающегоТегаОкончанияОперанда(РазбираемыйТекст,
			ТегНачалаХарактеристики, ТегОкончанияХарактеристики);
		
		Если НачалоПозицииХарактеристики = 1 Тогда
			ТекстПередХарактеристикой = "";
		Иначе
			ТекстПередХарактеристикой = Сред(РазбираемыйТекст, 1, НачалоПозицииХарактеристики - 1);
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстПередХарактеристикой) Тогда
			Части = СтрРазделить(ТекстПередХарактеристикой, РазделительЧастейОперанда, Ложь);
			Для Каждого Часть Из Части Цикл
				Результат.Добавить(Часть);
			КонецЦикла;
		КонецЕсли;
		ЧастьХарактеристики = Сред(РазбираемыйТекст,
			НачалоПозицииХарактеристики,
			КонецПозицииХарактеристики - НачалоПозицииХарактеристики + 1);
		Результат.Добавить(ЧастьХарактеристики);
		
		РазбираемыйТекст = Сред(РазбираемыйТекст, КонецПозицииХарактеристики + 1);
		НачалоПозицииХарактеристики = СтрНайти(РазбираемыйТекст, ТегНачалаХарактеристики);
	КонецЦикла;
	Если НЕ ПустаяСтрока(РазбираемыйТекст) Тогда
		Части = СтрРазделить(РазбираемыйТекст, РазделительЧастейОперанда, Ложь);
		Для Каждого Часть Из Части Цикл
			Результат.Добавить(Часть);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив частей операнда, но в укрупненном виде: 
//  исполняемая СКД часть (метаданные+характеристики) - отдельно, каждый алгоритм - отдельно. 
Функция ЧастиОперандаМетаданныеИАлгоритмы(Операнд, ПредставленияХарактеристик = Ложь, УдалятьВнешниеСкобки = Истина) Экспорт
	ВсеЧасти = ЧастиОперанда(Операнд, ПредставленияХарактеристик, УдалятьВнешниеСкобки);
	
	УкрупненныеЧасти = Новый Массив;
	
	ПрефиксыАлгоритмов = tsc_РаботаСФормуламиВызовСервера.МассивПрефиковАлгоритмов();
	НакопленныйПуть = "";
	Для каждого Часть Из ВсеЧасти Цикл
	    ЭтоАлгоритм = Ложь;
		Если СтрНачинаетсяС(Часть, "{") Тогда
			Для каждого ПрефиксАлгоритма Из ПрефиксыАлгоритмов Цикл
				ПрефиксНачало = "{" + ПрефиксАлгоритма;
				Если СтрНачинаетсяС(Часть, ПрефиксНачало) Тогда
					ЭтоАлгоритм = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ЭтоАлгоритм Тогда
			Если НЕ НакопленныйПуть = "" Тогда
				УкрупненныеЧасти.Добавить(НакопленныйПуть);
			КонецЕсли;
			// Каждый алгоритм обрабатывается отдельно, поэтому они не объединяются
			УкрупненныеЧасти.Добавить(Часть);
			НакопленныйПуть = "";
		Иначе
			НакопленныйПуть = НакопленныйПуть + ?(НакопленныйПуть = "", "", ".") + Часть;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НакопленныйПуть = "" Тогда
		УкрупненныеЧасти.Добавить(НакопленныйПуть);
	КонецЕсли;
	
	Возврат УкрупненныеЧасти;
КонецФункции

Функция СпецСимволы() Экспорт
	СпецСимволы = " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
	Возврат СпецСимволы;
КонецФункции

#КонецОбласти

#Область ФункцииОбщегоМодуля

// Возвращает пустой массив структур описаний функций, которые можно вызвать при выполнении формулы.
// 
// Возвращаемое значение:
// 	Массив из см. ОписаниеФункцииОбщегоМодуля
//
Функция ФункцииОбщегоМодуля() Экспорт
	Результат = Новый Массив;
	
	Возврат Результат;
КонецФункции

// Возвращает структуру описания функции, которую можно вызвать при выполнении формулы.
// 
// Возвращаемое значение:
// 	Структура - описание дополнительной функции, используемой в конструкторе формул и при выполнении формулы, со свойствами:
// 	 *Идентификатор - Строка - Обязательное поле. Идентификатор функции на языке кода. Например "РасчетПоАлгоритму".
// 	 *ПолныйПуть - Строка - Обязательное поле. Включает имя общего модуля и имя функции.
// 	 		Например, "СложныеРасчеты.РасчетПоАлгоритму".
// 	 *Представление - Строка - Обязательное поле. Представление отображения функции на языке пользователя.
// 	 		Например, "Расчет по алгоритму".
// 	 *КонструкцияДляВставки - Строка - Обязательное поле. Текст, вставляемый в конструктор формул.
// 	 		Содержит идентификатор функции на языке кода.
// 			Также может содержать запятые, а также подсказки для пользователя на языке пользователя.
// 			Например, "РасчетПоАлгоритму(<Параметр функции 1>, <Параметр функции 2>)".
// 			В приведенном примере описания параметров "<Параметр функции 1>" могут быть помещены в НСтр для отображения
// 			пользователю.
// 	 *Пояснение - Строка - Необязательный параметр. Пояснение, выводимое в конструкторе формул при позиционировании
// 	 		на строке функции. На языке пользователя.
//
Функция ОписаниеФункцииОбщегоМодуля() Экспорт
	ОписаниеФункции = Новый Структура;
	// Обязательные параметры.
	ОписаниеФункции.Вставить("Идентификатор", "");
	ОписаниеФункции.Вставить("ПолныйПуть", "");
	ОписаниеФункции.Вставить("Представление", "");
	ОписаниеФункции.Вставить("КонструкцияДляВставки", "");
	
	// Необязательные параметры.
	ОписаниеФункции.Вставить("Пояснение", "");
	
	Возврат ОписаниеФункции;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает шаблон параметров дополнительных ограничений развертки операндов.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * РекурсивноРазворачиватьОперандыСхемыКомпоновки - Булево - Значение по умолчанию Истина (разворачиваются). Но можно отключить разворот строк
// 		одним параметром без указания соответствующего параметра для каждой строки дерева операндов.
// * МаксимальныйУровеньРазверткиСтрок - Число - Значение по умолчанию 0 (не контролируется). Контроль максимального уровня строк в дереве при развертке.
// * ВыводитьРеквизиты - Булево - Значение по умолчанию Истина. Флаг необходимости выводить обычные реквизиты при развертке.
// * ВыводитьХарактеристики - Булево - Значение по умолчанию Истина. Флаг необходимости выводить характеристики (доп.реквизиты и сведения, а также контактную информацию).
// * НаборыДополнительныхРеквизитов - Массив из СправочникСсылка.НаборыДополнительныхРеквизитовИСведений - Если массив пустой, то дополнительный отбор для доп.реквизитов
// 		и сведений по наборам не накладывается. Действует только отбор, описанный в метаданных (кнопка "Характеристики") для объектов
// 		из типа значения разворачиваемой строки.
// 		Если массив не пустой, то в дополнению к отбору из метаданных накладывается отбор на вхождение доп.реквизитов и сведений
// 		в указанные наборы.
// * ВыводимыеРеквизиты - Строка - Значение по умолчанию "" (вывод реквизитов не ограничивается). Возможность ограничить выводимые реквизиты списком, перечисленным через запятую.
// 		Если значение заполнено, то при выводе реквизита будет выполняться проверка на вхождение в этот список.
// * НеВыводимыеРеквизиты - Строка - Значение по умолчанию "" (вывод реквизитов не ограничивается). Возможность ограничить выводимые реквизиты списком, перечисленным через запятую.
// 		Если значение заполнено, то при выводе реквизита будет выполняться проверка на НЕ вхождение в этот список.
//
Функция ОграниченияРазверткиОперандов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("РекурсивноРазворачиватьОперандыСхемыКомпоновки", Истина);
	
	Результат.Вставить("МаксимальныйУровеньРазверткиСтрок", 0);
	
	Результат.Вставить("ВыводитьРеквизиты", Истина);                 
	Результат.Вставить("ВыводитьТабличныеЧасти", Истина);
	Результат.Вставить("ВыводитьХарактеристики", Истина);
	Результат.Вставить("ВыводитьАлгоритмы", Истина);
	
	// Результат выполнения алгоритма может иметь тип значения. Если он заполнен, то строки алгоритмов также могут быть развернуты.
	// Однако, при получении данных необходимо учитывать это. Получение данных будет выполняться блоками.
	Результат.Вставить("РазворачиватьСтрокиАлгоритмов", Истина);
	
	// На 1ом уровне развертки можно ограничить доп.реквизиты не только типом, но и наборами. 
	Результат.Вставить("НаборыДополнительныхРеквизитов", Новый Массив);    
	
	// Флаг, указывающий, что при развертке реквизиты нужно помещать в группу "Реквизиты" и таб.части в группу "ТабличныеЧасти".
	Результат.Вставить("РеквизитыИТабличныеЧастиВГруппах", Ложь);                                                             
	
	// Флаг, указывающий, что при развертке реквизиты нужно доп. сортировать по признаку Стандартный реквизит , обычный реквизит. 
	// Если Истина, работает медленнее.
	//Результат.Вставить("СтандартныеРеквизитыПередРеквизитами", Ложь);
	
	// Список реквизитов через запятую, при первой развертке будут выведены только эти реквизиты.
	Результат.Вставить("ВыводимыеРеквизиты", "");                                                         
	
	// Список реквизитов через запятую, при первой и последующих развертках эти реквизиты не будут выведены.
	Результат.Вставить("НеВыводимыеРеквизиты", "");
	
	// Список имен табличных частей через запятую, при первой и последующих развертках эти тч не будут выведены.
	Результат.Вставить("НеВыводимыеТабличныеЧасти", "");
	
	// Список префиксов выводимых алгоритмов. Алгоритмы, чей префикс не указан в не пустом списке, выводиться не будут.
	Результат.Вставить("ПрефиксыВыводимыхАлгоритмов", "");
	
	// Список префиксов Не выводимых алгоритмов. Алгоритмы, чей префикс указан в не пустом списке, выводиться не будут.
	Результат.Вставить("ПрефиксыНеВыводимыхАлгоритмов", "");
	
	// Флаг, указывающий, что не нужно выводить реквизиты и ТЧ, имя которых начинается со слова Удалить
	Результат.Вставить("НеВыводитьРеквизитыИТабличныеЧастиНачинающиесяСУдалить", Ложь);
	
	// Флаг, указывающий, что выводить табличные части можно только на 1ом уровне развертки.
	// Действительно, если разрешить выводить табличные части где угодно, то это будет означать,
	//    что на каждую строку 1ого уровня придется неколько строк последующего уровня и еще несколько строк
	//    последующего уровня. Количество строк каждого уровня должны быть перемножены.
	// В практических задачах это может иметь смысл, но редко.
	// Истина - означает, что табличные части будут доступны только на 1ом уровне развертки.
	// Ложь - табличные части доступны на любом уровне развертки, если вкл. признак "ВыводитьТабличныеЧасти" = истина.
	Результат.Вставить("ВыводитьТЧТолькоНа1омУровне", Ложь);	
	
	Возврат Результат;
	
КонецФункции

// Вычисляет значение идентификатора из строки соответствии с правилами
// именования идентификаторов.
// 
// Параметры:
// 	СтрокаПредставления - Строка - Представление, строка из которой необходимо получить идентификатор.
//
// Возвращаемое значение:
// 	Строка - Идентификатор, соответствующий правилам именования идентификаторов.
//
Функция ПолучитьИдентификатор(СтрокаПредставления, ЗаменятьСпецСимволыНижнимПодчеркиванием = Ложь)
	
	СпецСимволы = СпецСимволы();
	Цифры = "0123456789";
	
	Идентификатор = "";
	БылСпецСимвол = Ложь;
	БылиЗначащиеСимволыНеЦифры = Ложь;
	
	Для НомСимвола = 1 По СтрДлина(СтрокаПредставления) Цикл
		
		Символ = Сред(СтрокаПредставления, НомСимвола, 1);
		
		Если СтрНайти(СпецСимволы, Символ) <> 0 Тогда
			БылСпецСимвол = Истина;
			Если Символ = "_" Тогда
				Идентификатор = Идентификатор + Символ;
				БылиЗначащиеСимволыНеЦифры = Истина;
			ИначеЕсли ЗаменятьСпецСимволыНижнимПодчеркиванием Тогда
				Идентификатор = Идентификатор + "_";
				БылиЗначащиеСимволыНеЦифры = Истина;
			КонецЕсли;
		ИначеЕсли НЕ БылиЗначащиеСимволыНеЦифры
			И СтрНайти(Цифры, Символ) <> 0 Тогда
			БылСпецСимвол = Истина;
			Идентификатор = Идентификатор + Символ;
		ИначеЕсли БылСпецСимвол
			ИЛИ НомСимвола = 1 Тогда
			БылСпецСимвол = Ложь;
			Идентификатор = Идентификатор + ВРег(Символ);
			БылиЗначащиеСимволыНеЦифры = Истина;
		Иначе
			Идентификатор = Идентификатор + Символ;
			БылиЗначащиеСимволыНеЦифры = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Идентификатор;
	
КонецФункции

Функция ПозицияЗакрывающегоТегаОкончанияОперанда(ОставшаясяЧастьФормулы, ТегНачалаОперанда, ТегОкончанияОперанда)
	
	СчетчикВложенныхТегов = 0;
	Позиция = СтрНайти(ОставшаясяЧастьФормулы, ТегНачалаОперанда,, 1);
	
	СледующаяПозицияЗакрытия = 0;
	СчетчикВложенныхТегов = СчетчикВложенныхТегов + 1;
	Пока НЕ СчетчикВложенныхТегов = 0 Цикл
		// Например, операнд, включающий индекс строки табличной части.
		СледующаяПозицияОткрытия = СтрНайти(ОставшаясяЧастьФормулы, ТегНачалаОперанда,, Позиция + 1);
		СледующаяПозицияЗакрытия = СтрНайти(ОставшаясяЧастьФормулы, ТегОкончанияОперанда,, Позиция + 1);
		
		Если СледующаяПозицияОткрытия <> 0
			И (СледующаяПозицияОткрытия < СледующаяПозицияЗакрытия) Тогда
			Позиция = СледующаяПозицияОткрытия;
			СчетчикВложенныхТегов = СчетчикВложенныхТегов + 1;
		Иначе
			Позиция = СледующаяПозицияЗакрытия;
			СчетчикВложенныхТегов = СчетчикВложенныхТегов - 1;
		КонецЕсли;
		Если Позиция = 0 Тогда
			ТекстОшибки = НСтр("ru = 'Ошибка при разборе текста формулы: не найден тег закрытия операнда';
								|en = 'Error parsing formula text: operand close tag not found'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Позиция;
	
КонецФункции

#КонецОбласти

